@extends('layouts.main')

@section('style')
@endsection

@section('content')
    <div class="preloader"></div>

    <div id="fullPage" class="fullPage-main">
        <section class="section section__main">
            <video id="my-video" class="main__video" playsinline autoplay="" muted loop webkit-playsinline preload="auto" poster="" >
                <source src="/img/grandroad.webm" type="video/webm">
                <source src="/img/grandroad.mp4" type="video/mp4">
            </video>
            <div class="general__container">
                <div class="main__container">
                    <h1 class="general__title general__animate general__animate-yellow" data-content="{{ __('asd.Асфальтирование,') }}">
                        {{ __('asd.Асфальтирование,') }}
                    </h1>
                    <h2 class="general__title  general__animate" data-content="{{ __('asd.прокладка дорог, дорожно- строительные работы') }}">{{ __('asd.прокладка дорог, дорожно- строительные работы') }}</h2>
                    <p class="general__subtitle">
                        {{ __('asd.Процветания, благополучия, хороших дорог, красивых и благоустроенных городов! Компания «GRAND ROAD TASHKENT» - Мы за процветание страны!') }}
                    </p>
                    <div class="main__buttons section__buttons">
                        <a class="feedback__btn" href="text:javascript">
                            {{ __('asd.Узнать больше') }}
                        </a>
                        <a href="{{ \App\Models\Catalog::find(1)->catalog }}" download>
                            {{ __('asd.Скачать каталог') }}
                        </a>
                    </div>
                </div>
            </div>
        </section>
        <section class="section section__service">
            <div class="general__container">
                <div class="service__container">
                    <h2 class="general__title general__animate general__animate-yellow" data-content="{{ __('asd.наши услуги') }}"><span>{{ __('asd.наши услуги') }}</span></h2>
                    <p class="general__subtitle">
                        {!! __('asd.Наши специалисты работают на современном оборудовании, а для<br> выполнения поставленных задач используют высококачественные материалы.') !!}
                    </p>
                    <div class="service__main right-to-left mob-off">
                        <a href="/technics" class="service__main-box">
                            <div class="pic">
                                <svg class="st" width="70" height="70" viewBox="0 0 70 70">
                                    <path pathLength="1" class="st__circle" d="m35,2.5c17.955803,0 32.5,14.544199 32.5,32.5c0,17.955803 -14.544197,32.5 -32.5,32.5c-17.955803,0 -32.5,-14.544197 -32.5,-32.5c0,-17.955801 14.544197,-32.5 32.5,-32.5z"></path>
                                </svg>
                                <svg class="pic__svg" width="120" height="120" viewBox="0 0 120 120" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M55.999 27.501L40.1982 84.0006H80.9982L63.499 27.501H55.999Z" stroke="white" stroke-width="2.4"/>
                                    <path d="M40.7986 72.0005H28.7986L21.5986 93.0005H97.7986L89.3986 72.0005H80.3986" stroke="white" stroke-width="2.4"/>
                                </svg>
                            </div>
                            <p class="name">{{ __('asd.Дорожное строительство') }}</p>
                        </a>
                        <a href="/planing" class="service__main-box">
                            <div class="pic">
                                <svg class="st" width="70" height="70" viewBox="0 0 70 70">
                                    <path pathLength="1" class="st__circle" d="m35,2.5c17.955803,0 32.5,14.544199 32.5,32.5c0,17.955803 -14.544197,32.5 -32.5,32.5c-17.955803,0 -32.5,-14.544197 -32.5,-32.5c0,-17.955801 14.544197,-32.5 32.5,-32.5z"></path>
                                </svg>
                                <svg class="pic__svg" width="121" height="121" viewBox="0 0 121 121" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M60.5 23.0005L21 43.1096L60.5 63.2187L100 43.1096L60.5 23.0005Z" stroke="white" stroke-width="2"/>
                                    <path d="M60.5 40.2368L21 60.3459L60.5 80.455L100 60.3459L60.5 40.2368Z" stroke="white" stroke-width="2"/>
                                    <path d="M60.5 57.4731L21 77.5822L60.5 97.6913L100 77.5822L60.5 57.4731Z" stroke="white" stroke-width="2"/>
                                </svg>
                            </div>
                            <p class="name">{{ __('asd.Проектирование') }}</p>
                        </a>
                        <a href="/asphalt" class="service__main-box">
                            <div class="pic">
                                <svg class="st" width="70" height="70" viewBox="0 0 70 70">
                                    <path pathLength="1" class="st__circle" d="m35,2.5c17.955803,0 32.5,14.544199 32.5,32.5c0,17.955803 -14.544197,32.5 -32.5,32.5c-17.955803,0 -32.5,-14.544197 -32.5,-32.5c0,-17.955801 14.544197,-32.5 32.5,-32.5z"></path>
                                </svg>
                                <svg class="pic__svg" width="122" height="121" viewBox="0 0 122 121" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M54.9477 28.436V48.4011L41.6377 61.7112V92.5663" stroke="white" stroke-width="2.42001"/>
                                    <path d="M63.4175 27.8301V51.4252L50.1074 64.7352V93.1703" stroke="white" stroke-width="2.42001"/>
                                    <path d="M72.4961 27.8301V53.8452L58.5811 67.1552V93.1703" stroke="white" stroke-width="2.42001"/>
                                    <path d="M80.961 27.8301V56.8702L67.0459 70.1802V93.1703" stroke="white" stroke-width="2.42001"/>
                                </svg>
                            </div>
                            <p class="name">{{ __('asd.Разметка дорог') }}</p>
                        </a>
                        <a href="/lab" class="service__main-box">
                            <div class="pic">
                                <svg class="st" width="70" height="70" viewBox="0 0 70 70">
                                    <path pathLength="1" class="st__circle" d="m35,2.5c17.955803,0 32.5,14.544199 32.5,32.5c0,17.955803 -14.544197,32.5 -32.5,32.5c-17.955803,0 -32.5,-14.544197 -32.5,-32.5c0,-17.955801 14.544197,-32.5 32.5,-32.5z"></path>
                                </svg>
                                <svg class="pic__svg" width="122" height="121" viewBox="0 0 122 121" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M80.8531 89.543H48.2026L45.2725 98.013H83.9926L80.8531 89.543Z" stroke="white" stroke-width="2.42001"/>
                                    <path d="M67.6653 25.4111H61.0859V29.4319H67.6653V25.4111Z" stroke="white" stroke-width="2.42001"/>
                                    <path d="M67.6653 53.5552H61.0859V57.5759H67.6653V53.5552Z" stroke="white" stroke-width="2.42001"/>
                                    <path d="M70.5904 29.4307H58.1626L57.9814 34.4857L58.1626 47.4631V53.5551H70.5904V29.4307Z" stroke="white" stroke-width="2.42001"/>
                                    <path d="M70.475 84.9916V84.9982V85.0048V85.0113V85.0179V85.0246V85.0312V85.0378V85.0444V85.051V85.0577V85.0643V85.071V85.0776V85.0843V85.091V85.0976V85.1043V85.111V85.1177V85.1244V85.1311V85.1378V85.1445V85.1513V85.158V85.1647V85.1714V85.1782V85.1849V85.1917V85.1984V85.2052V85.212V85.2187V85.2255V85.2323V85.2391V85.2459V85.2527V85.2595V85.2663V85.2731V85.2799V85.2867V85.2935V85.3003V85.3072V85.314V85.3208V85.3276V85.3345V85.3413V85.3482V85.355V85.3619V85.3687V85.3756V85.3824V85.3893V85.3962V85.403V85.4099V85.4168V85.4236V85.4305V85.4374V85.4443V85.4511V85.458V85.4649V85.4718V85.4787V85.4856V85.4925V85.4994V85.5063V85.5132V85.5201V85.527V85.5338V85.5407V85.5477V85.5546V85.5615V85.5684V85.5753V85.5822V85.5891V85.596V85.6029V85.6098V85.6167V85.6236V85.6305V85.6374V85.6443V85.6512V85.6581V85.665V85.6719V85.6788V85.6857V85.6926V85.6995V85.7064V85.7133V85.7202V85.7271V85.734V85.7409V85.7478V85.7547V85.7616V85.7685V85.7753V85.7822V85.7891V85.796V85.8029V85.8097V85.8166V85.8235V85.8304V85.8372V85.8441V85.851V85.8578V85.8647V85.8715V85.8784V85.8852V85.8921V85.8989V85.9057V85.9126V85.9194V85.9262V85.9331V85.9399V85.9467V85.9535V85.9603V85.9671V85.9739V85.9807V85.9875V85.9943V86.0011V86.0079V86.0146V86.0214V86.0282V86.0349V86.0417V86.0485V86.0552V86.0619V86.0687V86.0754V86.0821V86.0889V86.0956V86.1023V86.109V86.1157V86.1224V86.1291V86.1358V86.1424V86.1491V86.1558V86.1624V86.1691V86.1757V86.1824V86.189V86.1956V86.2022V86.2089V86.2155V86.2221V86.2287V86.2352V86.2418V86.2484V86.2549V86.2615V86.2681V86.2746V86.2811V86.2877V86.2942V86.3007V86.3072V86.3137V86.3202V86.3266V86.3331V86.3396V86.3402H70.4645H70.4515H70.4383H70.4252H70.412H70.3987H70.3854H70.372H70.3586H70.3451H70.3316H70.318H70.3043H70.2907H70.2769H70.2631H70.2493H70.2354H70.2215H70.2075H70.1934H70.1794H70.1652H70.151H70.1368H70.1225H70.1082H70.0938H70.0794H70.0649H70.0504H70.0358H70.0212H70.0066H69.9919H69.9771H69.9623H69.9475H69.9326H69.9177H69.9027H69.8877H69.8726H69.8575H69.8424H69.8272H69.8119H69.7967H69.7814H69.766H69.7506H69.7352H69.7197H69.7041H69.6886H69.673H69.6573H69.6416H69.6259H69.6101H69.5943H69.5785H69.5626H69.5467H69.5307H69.5147H69.4987H69.4826H69.4665H69.4504H69.4342H69.418H69.4017H69.3854H69.3691H69.3527H69.3363H69.3199H69.3034H69.2869H69.2704H69.2538H69.2372H69.2206H69.2039H69.1872H69.1705H69.1537H69.1369H69.1201H69.1032H69.0863H69.0694H69.0525H69.0355H69.0185H69.0014H68.9843H68.9672H68.9501H68.9329H68.9158H68.8985H68.8813H68.864H68.8467H68.8294H68.812H68.7946H68.7772H68.7598H68.7423H68.7248H68.7073H68.6898H68.6722H68.6546H68.637H68.6194H68.6017H68.584H68.5663H68.5486H68.5308H68.513H68.4952H68.4774H68.4596H68.4417H68.4238H68.4059H68.3879H68.37H68.352H68.334H68.316H68.298H68.2799H68.2618H68.2438H68.2256H68.2075H68.1894H68.1712H68.153H68.1348H68.1166H68.0984H68.0801H68.0619H68.0436H68.0253H68.007H67.9886H67.9703H67.9519H67.9335H67.9152H67.8968H67.8783H67.8599H67.8415H67.823H67.8045H67.786H67.7676H67.749H67.7305H67.712H67.6935H67.6749H67.6563H67.6378H67.6192H67.6006H67.582H67.5634H67.5447H67.5261H67.5075H67.4888H67.4702H67.4515H67.4328H67.4142H67.3955H67.3768H67.3581H67.3394H67.3206H67.3019H67.2832H67.2645H67.2457H67.227H67.2083H67.1895H67.1707H67.152H67.1332H67.1145H67.0957H67.0769H67.0582H67.0394H67.0206H67.0018H66.983H66.9643H66.9455H66.9267H66.9079H66.8891H66.8703H66.8516H66.8328H66.814H66.7952H66.7764H66.7576H66.7389H66.7201H66.7013H66.6826H66.6638H66.645H66.6263H66.6075H66.5887H66.57H66.5512H66.5325H66.5138H66.495H66.4763H66.4576H66.4389H66.4202H66.4015H66.3828H66.3641H66.3454H66.3267H66.3081H66.2894H66.2708H66.2521H66.2335H66.2149H66.1962H66.1776H66.159H66.1405H66.1219H66.1033H66.0848H66.0662H66.0477H66.0292H66.0107H65.9922H65.9737H65.9552H65.9367H65.9183H65.8999H65.8815H65.863H65.8447H65.8263H65.8079H65.7896H65.7712H65.7529H65.7346H65.7163H65.6981H65.6798H65.6616H65.6434H65.6251H65.607H65.5888H65.5706H65.5525H65.5344H65.5163H65.4982H65.4802H65.4621H65.4441H65.4261H65.4082H65.3902H65.3723H65.3543H65.3365H65.3186H65.3007H65.2829H65.2651H65.2473H65.2295H65.2118H65.1941H65.1764H65.1587H65.1411H65.1235H65.1059H65.0883H65.0708H65.0533H65.0358H65.0183H65.0008H64.9834H64.966H64.9487H64.9313H64.914H64.8968H64.8795H64.8623H64.8451H64.8279H64.8108H64.7937H64.7766H64.7596H64.7425H64.7255H64.7086H64.6917H64.6748H64.6579H64.6411H64.6243H64.6075H64.5908H64.574H64.5574H64.54H64.5225H64.5051H64.4876H64.4701H64.4525H64.435H64.4174H64.3998H64.3821H64.3645H64.3468H64.3291H64.3113H64.2936H64.2758H64.258H64.2401H64.2223H64.2044H64.1865H64.1686H64.1506H64.1327H64.1147H64.0967H64.0786H64.0606H64.0425H64.0244H64.0063H63.9882H63.97H63.9519H63.9337H63.9155H63.8972H63.879H63.8607H63.8424H63.8241H63.8058H63.7875H63.7691H63.7508H63.7324H63.714H63.6956H63.6771H63.6587H63.6402H63.6217H63.6033H63.5847H63.5662H63.5477H63.5291H63.5106H63.492H63.4734H63.4548H63.4362H63.4176H63.3989H63.3803H63.3616H63.3429H63.3242H63.3055H63.2868H63.2681H63.2494H63.2306H63.2119H63.1931H63.1744H63.1556H63.1368H63.118H63.0992H63.0804H63.0616H63.0428H63.0239H63.0051H62.9862H62.9674H62.9485H62.9296H62.9108H62.8919H62.873H62.8541H62.8352H62.8163H62.7974H62.7785H62.7596H62.7407H62.7218H62.7028H62.6839H62.665H62.646H62.6271H62.6082H62.5892H62.5703H62.5514H62.5324H62.5135H62.4945H62.4756H62.4566H62.4377H62.4187H62.3998H62.3809H62.3619H62.343H62.324H62.3051H62.2862H62.2672H62.2483H62.2294H62.2104H62.1915H62.1726H62.1537H62.1348H62.1159H62.097H62.0781H62.0592H62.0403H62.0214H62.0025H61.9836H61.9648H61.9459H61.927H61.9082H61.8894H61.8705H61.8517H61.8329H61.8141H61.7953H61.7765H61.7577H61.7389H61.7201H61.7014H61.6826H61.6639H61.6452H61.6265H61.6077H61.589H61.5704H61.5517H61.533H61.5144H61.4957H61.4771H61.4585H61.4399H61.4213H61.4027H61.3842H61.3656H61.3471H61.3285H61.31H61.2915H61.2731H61.2546H61.2362H61.2177H61.1993H61.1809H61.1625H61.1442H61.1258H61.1075H61.0892H61.0709H61.0526H61.0343H61.0161H60.9979H60.9796H60.9615H60.9433H60.9251H60.907H60.8889H60.8708H60.8527H60.8347H60.8167H60.7986H60.7807H60.7627H60.7448H60.7268H60.7089H60.6911H60.6732H60.6554H60.6376H60.6198H60.602H60.5843H60.5666H60.5489H60.5312H60.5136H60.496H60.4784H60.4608H60.4433H60.4258H60.4083H60.3908H60.3734H60.356H60.3386H60.3213H60.3039H60.2866H60.2694H60.2521H60.2349H60.2178H60.2006H60.1835H60.1664H60.1493H60.1323H60.1153H60.0983H60.0814H60.0645H60.0476H60.0308H60.014H59.9972H59.9804H59.9637H59.947H59.9304H59.9138H59.8972H59.8806H59.8641H59.8476H59.8312H59.8148H59.7984H59.7821H59.7657H59.7495H59.7332H59.717H59.7009H59.6847H59.6687H59.6526H59.6366H59.6206H59.6047H59.5888H59.5729H59.5571H59.5413H59.5256H59.5098H59.4942H59.4785H59.463H59.4474H59.4319H59.4164H59.401H59.3856H59.3703H59.355H59.3397H59.3245H59.3093H59.2942H59.2791H59.264H59.249H59.2341H59.2192H59.2043H59.1895H59.1747H59.1599H59.1452H59.1306H59.116H59.1014H59.0869H59.0724H59.058H59.0437H59.0293H59.0151H59.0008H58.9866H58.9725H58.9584H58.9444H58.9304H58.9164H58.9025H58.8887H58.8749H58.8612H58.8475H58.8338H58.8202H58.8067H58.7932H58.7797H58.7664H58.753H58.7397H58.7265H58.7133H58.7002H58.6871H58.6741H58.6611H58.6482H58.6398L58.6397 84.9916C58.6397 81.5934 61.3178 78.8912 64.5574 78.8912C67.7969 78.8912 70.475 81.5934 70.475 84.9916Z" stroke="white" stroke-width="2.42001"/>
                                    <path d="M57.9809 84.7032L39.2236 75.0232V52.0331L48.2987 41.748H54.9537" stroke="white" stroke-width="2.42001"/>
                                </svg>
                            </div>
                            <p class="name">{{ __('asd.Лаборатория') }}</p>
                        </a>
                        <a href="/projects" class="service__main-box">
                            <div class="pic">
                                <svg class="st" width="70" height="70" viewBox="0 0 70 70">
                                    <path pathLength="1" class="st__circle" d="m35,2.5c17.955803,0 32.5,14.544199 32.5,32.5c0,17.955803 -14.544197,32.5 -32.5,32.5c-17.955803,0 -32.5,-14.544197 -32.5,-32.5c0,-17.955801 14.544197,-32.5 32.5,-32.5z"></path>
                                </svg>
                                <svg class="pic__svg" width="121" height="121" viewBox="0 0 121 121" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M22.9951 95.5909V39.3257H79.8653V95.5909H22.9951Z" stroke="white" stroke-width="2.42001"/>
                                    <path d="M39.9385 81.6763V25.4111H96.8087V81.6763H39.9385Z" stroke="white" stroke-width="2.42001"/>
                                </svg>
                            </div>
                            <p class="name">{{ __('asd.Производство') }}</p>
                        </a>
                    </div>
                    <div class="service__mob desc-off">
                        <button class="service__slider-prev general__slider-arrows">
                            <svg width="14" height="22" viewBox="0 0 14 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M12.3839 2.88388L13.2678 2L11.5 0.232233L10.6161 1.11612L12.3839 2.88388ZM2.5 11L1.61612 10.1161L0.732233 11L1.61612 11.8839L2.5 11ZM10.6161 20.8839L11.5 21.7678L13.2678 20L12.3839 19.1161L10.6161 20.8839ZM10.6161 1.11612L1.61612 10.1161L3.38388 11.8839L12.3839 2.88388L10.6161 1.11612ZM1.61612 11.8839L10.6161 20.8839L12.3839 19.1161L3.38388 10.1161L1.61612 11.8839Z" fill="white"/>
                            </svg>
                        </button>
                        <button class="service__slider-next general__slider-arrows">
                            <svg width="14" height="22" viewBox="0 0 14 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M1.61612 2.88388L0.732233 2L2.5 0.232233L3.38388 1.11612L1.61612 2.88388ZM11.5 11L12.3839 10.1161L13.2678 11L12.3839 11.8839L11.5 11ZM3.38388 20.8839L2.5 21.7678L0.732233 20L1.61612 19.1161L3.38388 20.8839ZM3.38388 1.11612L12.3839 10.1161L10.6161 11.8839L1.61612 2.88388L3.38388 1.11612ZM12.3839 11.8839L3.38388 20.8839L1.61612 19.1161L10.6161 10.1161L12.3839 11.8839Z" fill="white"/>
                            </svg>
                        </button>
                        <div class="service__slider owl-carousel">
                            <a href="/technics" class="service__main-box">
                                <div class="pic">
                                    <svg class="st" width="70" height="70" viewBox="0 0 70 70">
                                        <path pathLength="1" class="st__circle" d="m35,2.5c17.955803,0 32.5,14.544199 32.5,32.5c0,17.955803 -14.544197,32.5 -32.5,32.5c-17.955803,0 -32.5,-14.544197 -32.5,-32.5c0,-17.955801 14.544197,-32.5 32.5,-32.5z"></path>
                                    </svg>
                                    <svg class="pic__svg" width="120" height="120" viewBox="0 0 120 120" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M55.999 27.501L40.1982 84.0006H80.9982L63.499 27.501H55.999Z" stroke="white" stroke-width="2.4"/>
                                        <path d="M40.7986 72.0005H28.7986L21.5986 93.0005H97.7986L89.3986 72.0005H80.3986" stroke="white" stroke-width="2.4"/>
                                    </svg>
                                </div>
                                <p class="name">{{ __('asd.Дорожное строительство') }}</p>
                            </a>
                            <a href="/planing" class="service__main-box">
                                <div class="pic">
                                    <svg class="st" width="70" height="70" viewBox="0 0 70 70">
                                        <path pathLength="1" class="st__circle" d="m35,2.5c17.955803,0 32.5,14.544199 32.5,32.5c0,17.955803 -14.544197,32.5 -32.5,32.5c-17.955803,0 -32.5,-14.544197 -32.5,-32.5c0,-17.955801 14.544197,-32.5 32.5,-32.5z"></path>
                                    </svg>
                                    <svg class="pic__svg" width="121" height="121" viewBox="0 0 121 121" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M60.5 23.0005L21 43.1096L60.5 63.2187L100 43.1096L60.5 23.0005Z" stroke="white" stroke-width="2"/>
                                        <path d="M60.5 40.2368L21 60.3459L60.5 80.455L100 60.3459L60.5 40.2368Z" stroke="white" stroke-width="2"/>
                                        <path d="M60.5 57.4731L21 77.5822L60.5 97.6913L100 77.5822L60.5 57.4731Z" stroke="white" stroke-width="2"/>
                                    </svg>
                                </div>
                                <p class="name">{{ __('asd.Проектирование') }}</p>
                            </a>
                            <a href="/asphalt" class="service__main-box">
                                <div class="pic">
                                    <svg class="st" width="70" height="70" viewBox="0 0 70 70">
                                        <path pathLength="1" class="st__circle" d="m35,2.5c17.955803,0 32.5,14.544199 32.5,32.5c0,17.955803 -14.544197,32.5 -32.5,32.5c-17.955803,0 -32.5,-14.544197 -32.5,-32.5c0,-17.955801 14.544197,-32.5 32.5,-32.5z"></path>
                                    </svg>
                                    <svg class="pic__svg" width="122" height="121" viewBox="0 0 122 121" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M54.9477 28.436V48.4011L41.6377 61.7112V92.5663" stroke="white" stroke-width="2.42001"/>
                                        <path d="M63.4175 27.8301V51.4252L50.1074 64.7352V93.1703" stroke="white" stroke-width="2.42001"/>
                                        <path d="M72.4961 27.8301V53.8452L58.5811 67.1552V93.1703" stroke="white" stroke-width="2.42001"/>
                                        <path d="M80.961 27.8301V56.8702L67.0459 70.1802V93.1703" stroke="white" stroke-width="2.42001"/>
                                    </svg>
                                </div>
                                <p class="name">{{ __('asd.Разметка дорог') }}</p>
                            </a>
                            <a href="/lab" class="service__main-box">
                                <div class="pic">
                                    <svg class="st" width="70" height="70" viewBox="0 0 70 70">
                                        <path pathLength="1" class="st__circle" d="m35,2.5c17.955803,0 32.5,14.544199 32.5,32.5c0,17.955803 -14.544197,32.5 -32.5,32.5c-17.955803,0 -32.5,-14.544197 -32.5,-32.5c0,-17.955801 14.544197,-32.5 32.5,-32.5z"></path>
                                    </svg>
                                    <svg class="pic__svg" width="122" height="121" viewBox="0 0 122 121" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M80.8531 89.543H48.2026L45.2725 98.013H83.9926L80.8531 89.543Z" stroke="white" stroke-width="2.42001"/>
                                        <path d="M67.6653 25.4111H61.0859V29.4319H67.6653V25.4111Z" stroke="white" stroke-width="2.42001"/>
                                        <path d="M67.6653 53.5552H61.0859V57.5759H67.6653V53.5552Z" stroke="white" stroke-width="2.42001"/>
                                        <path d="M70.5904 29.4307H58.1626L57.9814 34.4857L58.1626 47.4631V53.5551H70.5904V29.4307Z" stroke="white" stroke-width="2.42001"/>
                                        <path d="M70.475 84.9916V84.9982V85.0048V85.0113V85.0179V85.0246V85.0312V85.0378V85.0444V85.051V85.0577V85.0643V85.071V85.0776V85.0843V85.091V85.0976V85.1043V85.111V85.1177V85.1244V85.1311V85.1378V85.1445V85.1513V85.158V85.1647V85.1714V85.1782V85.1849V85.1917V85.1984V85.2052V85.212V85.2187V85.2255V85.2323V85.2391V85.2459V85.2527V85.2595V85.2663V85.2731V85.2799V85.2867V85.2935V85.3003V85.3072V85.314V85.3208V85.3276V85.3345V85.3413V85.3482V85.355V85.3619V85.3687V85.3756V85.3824V85.3893V85.3962V85.403V85.4099V85.4168V85.4236V85.4305V85.4374V85.4443V85.4511V85.458V85.4649V85.4718V85.4787V85.4856V85.4925V85.4994V85.5063V85.5132V85.5201V85.527V85.5338V85.5407V85.5477V85.5546V85.5615V85.5684V85.5753V85.5822V85.5891V85.596V85.6029V85.6098V85.6167V85.6236V85.6305V85.6374V85.6443V85.6512V85.6581V85.665V85.6719V85.6788V85.6857V85.6926V85.6995V85.7064V85.7133V85.7202V85.7271V85.734V85.7409V85.7478V85.7547V85.7616V85.7685V85.7753V85.7822V85.7891V85.796V85.8029V85.8097V85.8166V85.8235V85.8304V85.8372V85.8441V85.851V85.8578V85.8647V85.8715V85.8784V85.8852V85.8921V85.8989V85.9057V85.9126V85.9194V85.9262V85.9331V85.9399V85.9467V85.9535V85.9603V85.9671V85.9739V85.9807V85.9875V85.9943V86.0011V86.0079V86.0146V86.0214V86.0282V86.0349V86.0417V86.0485V86.0552V86.0619V86.0687V86.0754V86.0821V86.0889V86.0956V86.1023V86.109V86.1157V86.1224V86.1291V86.1358V86.1424V86.1491V86.1558V86.1624V86.1691V86.1757V86.1824V86.189V86.1956V86.2022V86.2089V86.2155V86.2221V86.2287V86.2352V86.2418V86.2484V86.2549V86.2615V86.2681V86.2746V86.2811V86.2877V86.2942V86.3007V86.3072V86.3137V86.3202V86.3266V86.3331V86.3396V86.3402H70.4645H70.4515H70.4383H70.4252H70.412H70.3987H70.3854H70.372H70.3586H70.3451H70.3316H70.318H70.3043H70.2907H70.2769H70.2631H70.2493H70.2354H70.2215H70.2075H70.1934H70.1794H70.1652H70.151H70.1368H70.1225H70.1082H70.0938H70.0794H70.0649H70.0504H70.0358H70.0212H70.0066H69.9919H69.9771H69.9623H69.9475H69.9326H69.9177H69.9027H69.8877H69.8726H69.8575H69.8424H69.8272H69.8119H69.7967H69.7814H69.766H69.7506H69.7352H69.7197H69.7041H69.6886H69.673H69.6573H69.6416H69.6259H69.6101H69.5943H69.5785H69.5626H69.5467H69.5307H69.5147H69.4987H69.4826H69.4665H69.4504H69.4342H69.418H69.4017H69.3854H69.3691H69.3527H69.3363H69.3199H69.3034H69.2869H69.2704H69.2538H69.2372H69.2206H69.2039H69.1872H69.1705H69.1537H69.1369H69.1201H69.1032H69.0863H69.0694H69.0525H69.0355H69.0185H69.0014H68.9843H68.9672H68.9501H68.9329H68.9158H68.8985H68.8813H68.864H68.8467H68.8294H68.812H68.7946H68.7772H68.7598H68.7423H68.7248H68.7073H68.6898H68.6722H68.6546H68.637H68.6194H68.6017H68.584H68.5663H68.5486H68.5308H68.513H68.4952H68.4774H68.4596H68.4417H68.4238H68.4059H68.3879H68.37H68.352H68.334H68.316H68.298H68.2799H68.2618H68.2438H68.2256H68.2075H68.1894H68.1712H68.153H68.1348H68.1166H68.0984H68.0801H68.0619H68.0436H68.0253H68.007H67.9886H67.9703H67.9519H67.9335H67.9152H67.8968H67.8783H67.8599H67.8415H67.823H67.8045H67.786H67.7676H67.749H67.7305H67.712H67.6935H67.6749H67.6563H67.6378H67.6192H67.6006H67.582H67.5634H67.5447H67.5261H67.5075H67.4888H67.4702H67.4515H67.4328H67.4142H67.3955H67.3768H67.3581H67.3394H67.3206H67.3019H67.2832H67.2645H67.2457H67.227H67.2083H67.1895H67.1707H67.152H67.1332H67.1145H67.0957H67.0769H67.0582H67.0394H67.0206H67.0018H66.983H66.9643H66.9455H66.9267H66.9079H66.8891H66.8703H66.8516H66.8328H66.814H66.7952H66.7764H66.7576H66.7389H66.7201H66.7013H66.6826H66.6638H66.645H66.6263H66.6075H66.5887H66.57H66.5512H66.5325H66.5138H66.495H66.4763H66.4576H66.4389H66.4202H66.4015H66.3828H66.3641H66.3454H66.3267H66.3081H66.2894H66.2708H66.2521H66.2335H66.2149H66.1962H66.1776H66.159H66.1405H66.1219H66.1033H66.0848H66.0662H66.0477H66.0292H66.0107H65.9922H65.9737H65.9552H65.9367H65.9183H65.8999H65.8815H65.863H65.8447H65.8263H65.8079H65.7896H65.7712H65.7529H65.7346H65.7163H65.6981H65.6798H65.6616H65.6434H65.6251H65.607H65.5888H65.5706H65.5525H65.5344H65.5163H65.4982H65.4802H65.4621H65.4441H65.4261H65.4082H65.3902H65.3723H65.3543H65.3365H65.3186H65.3007H65.2829H65.2651H65.2473H65.2295H65.2118H65.1941H65.1764H65.1587H65.1411H65.1235H65.1059H65.0883H65.0708H65.0533H65.0358H65.0183H65.0008H64.9834H64.966H64.9487H64.9313H64.914H64.8968H64.8795H64.8623H64.8451H64.8279H64.8108H64.7937H64.7766H64.7596H64.7425H64.7255H64.7086H64.6917H64.6748H64.6579H64.6411H64.6243H64.6075H64.5908H64.574H64.5574H64.54H64.5225H64.5051H64.4876H64.4701H64.4525H64.435H64.4174H64.3998H64.3821H64.3645H64.3468H64.3291H64.3113H64.2936H64.2758H64.258H64.2401H64.2223H64.2044H64.1865H64.1686H64.1506H64.1327H64.1147H64.0967H64.0786H64.0606H64.0425H64.0244H64.0063H63.9882H63.97H63.9519H63.9337H63.9155H63.8972H63.879H63.8607H63.8424H63.8241H63.8058H63.7875H63.7691H63.7508H63.7324H63.714H63.6956H63.6771H63.6587H63.6402H63.6217H63.6033H63.5847H63.5662H63.5477H63.5291H63.5106H63.492H63.4734H63.4548H63.4362H63.4176H63.3989H63.3803H63.3616H63.3429H63.3242H63.3055H63.2868H63.2681H63.2494H63.2306H63.2119H63.1931H63.1744H63.1556H63.1368H63.118H63.0992H63.0804H63.0616H63.0428H63.0239H63.0051H62.9862H62.9674H62.9485H62.9296H62.9108H62.8919H62.873H62.8541H62.8352H62.8163H62.7974H62.7785H62.7596H62.7407H62.7218H62.7028H62.6839H62.665H62.646H62.6271H62.6082H62.5892H62.5703H62.5514H62.5324H62.5135H62.4945H62.4756H62.4566H62.4377H62.4187H62.3998H62.3809H62.3619H62.343H62.324H62.3051H62.2862H62.2672H62.2483H62.2294H62.2104H62.1915H62.1726H62.1537H62.1348H62.1159H62.097H62.0781H62.0592H62.0403H62.0214H62.0025H61.9836H61.9648H61.9459H61.927H61.9082H61.8894H61.8705H61.8517H61.8329H61.8141H61.7953H61.7765H61.7577H61.7389H61.7201H61.7014H61.6826H61.6639H61.6452H61.6265H61.6077H61.589H61.5704H61.5517H61.533H61.5144H61.4957H61.4771H61.4585H61.4399H61.4213H61.4027H61.3842H61.3656H61.3471H61.3285H61.31H61.2915H61.2731H61.2546H61.2362H61.2177H61.1993H61.1809H61.1625H61.1442H61.1258H61.1075H61.0892H61.0709H61.0526H61.0343H61.0161H60.9979H60.9796H60.9615H60.9433H60.9251H60.907H60.8889H60.8708H60.8527H60.8347H60.8167H60.7986H60.7807H60.7627H60.7448H60.7268H60.7089H60.6911H60.6732H60.6554H60.6376H60.6198H60.602H60.5843H60.5666H60.5489H60.5312H60.5136H60.496H60.4784H60.4608H60.4433H60.4258H60.4083H60.3908H60.3734H60.356H60.3386H60.3213H60.3039H60.2866H60.2694H60.2521H60.2349H60.2178H60.2006H60.1835H60.1664H60.1493H60.1323H60.1153H60.0983H60.0814H60.0645H60.0476H60.0308H60.014H59.9972H59.9804H59.9637H59.947H59.9304H59.9138H59.8972H59.8806H59.8641H59.8476H59.8312H59.8148H59.7984H59.7821H59.7657H59.7495H59.7332H59.717H59.7009H59.6847H59.6687H59.6526H59.6366H59.6206H59.6047H59.5888H59.5729H59.5571H59.5413H59.5256H59.5098H59.4942H59.4785H59.463H59.4474H59.4319H59.4164H59.401H59.3856H59.3703H59.355H59.3397H59.3245H59.3093H59.2942H59.2791H59.264H59.249H59.2341H59.2192H59.2043H59.1895H59.1747H59.1599H59.1452H59.1306H59.116H59.1014H59.0869H59.0724H59.058H59.0437H59.0293H59.0151H59.0008H58.9866H58.9725H58.9584H58.9444H58.9304H58.9164H58.9025H58.8887H58.8749H58.8612H58.8475H58.8338H58.8202H58.8067H58.7932H58.7797H58.7664H58.753H58.7397H58.7265H58.7133H58.7002H58.6871H58.6741H58.6611H58.6482H58.6398L58.6397 84.9916C58.6397 81.5934 61.3178 78.8912 64.5574 78.8912C67.7969 78.8912 70.475 81.5934 70.475 84.9916Z" stroke="white" stroke-width="2.42001"/>
                                        <path d="M57.9809 84.7032L39.2236 75.0232V52.0331L48.2987 41.748H54.9537" stroke="white" stroke-width="2.42001"/>
                                    </svg>
                                </div>
                                <p class="name">{{ __('asd.Лаборатория') }}</p>
                            </a>
                            <a href="/projects" class="service__main-box">
                                <div class="pic">
                                    <svg class="st" width="70" height="70" viewBox="0 0 70 70">
                                        <path pathLength="1" class="st__circle" d="m35,2.5c17.955803,0 32.5,14.544199 32.5,32.5c0,17.955803 -14.544197,32.5 -32.5,32.5c-17.955803,0 -32.5,-14.544197 -32.5,-32.5c0,-17.955801 14.544197,-32.5 32.5,-32.5z"></path>
                                    </svg>
                                    <svg class="pic__svg" width="121" height="121" viewBox="0 0 121 121" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M22.9951 95.5909V39.3257H79.8653V95.5909H22.9951Z" stroke="white" stroke-width="2.42001"/>
                                        <path d="M39.9385 81.6763V25.4111H96.8087V81.6763H39.9385Z" stroke="white" stroke-width="2.42001"/>
                                    </svg>
                                </div>
                                <p class="name">{{ __('asd.Производство') }}</p>
                            </a>
                        </div>
                        <div id="general__slider-dots" class="general__slider-dots"></div>
                    </div>
                </div>
            </div>
        </section>
        <section class="section section__production">
            <div class="production__container">
                <div class="production__container-left">
                    <div class="content">
                        <h2 class="general__title general__animate" data-content="{{ __('asd.Производство') }}">{{ __('asd.Производство') }}</h2>
                        <p class="general__subtitle">{{ __('asd.Нами используются современные технологии ремонта и асфальтирования дорожного покрытия. Мы успешно применяем европейские технологии. При выполнении работ используются материалы соответствующие дорожно-строительным гостам.') }}</p>
                    </div>
                </div>
                <div class="production__container-right">
                    <div class="mob-off">
                        <img class="right__banner  right__banner-one active"  src="/img/production/1.webp" alt="">
                        <div class="right__content right__content-one">
                            <div class="box active">
                                <img src="/img/production/1.webp" alt="">
                                <h4><span>{{ \App\Models\Production::find(1)->workers }}</span>+</h4>
                                <p>{{ __('asd.Количество работников') }}</p>
                            </div>
                            <div class="box">
                                <img src="/img/production/2.webp" alt="">
                                <h4><span>{{ \App\Models\Production::find(1)->territory }}</span>+</h4>
                                <p>{{ __('asd.Территория карьера') }}</p>
                            </div>
                            <div class="box">
                                <img src="/img/production/3.webp" alt="">
                                <h4><span>{{ \App\Models\Production::find(1)->years }}</span>+</h4>
                                <p>{{ __('asd.лет на рынке') }}</p>
                            </div>
                            <a href="" class="btn__video" data-fancybox="gallery">
                                <svg width="94" height="94" viewBox="0 0 94 94" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="47" cy="47" r="35" fill="white"/>
                                    <path d="M54.4648 45.9287C55.7982 46.6985 55.7982 48.623 54.4648 49.3928L42.6661 56.2048C41.3328 56.9746 39.6661 56.0124 39.6661 54.4728L39.6661 40.8487C39.6661 39.3091 41.3328 38.3469 42.6661 39.1167L54.4648 45.9287Z" fill="#363435"/>
                                </svg>
                            </a>
                        </div>
                    </div>
                    <div class="production__mob desc-off">
                        <button class="production__slider-prev general__slider-arrows">
                            <svg width="14" height="22" viewBox="0 0 14 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M12.3839 2.88388L13.2678 2L11.5 0.232233L10.6161 1.11612L12.3839 2.88388ZM2.5 11L1.61612 10.1161L0.732233 11L1.61612 11.8839L2.5 11ZM10.6161 20.8839L11.5 21.7678L13.2678 20L12.3839 19.1161L10.6161 20.8839ZM10.6161 1.11612L1.61612 10.1161L3.38388 11.8839L12.3839 2.88388L10.6161 1.11612ZM1.61612 11.8839L10.6161 20.8839L12.3839 19.1161L3.38388 10.1161L1.61612 11.8839Z" fill="white"/>
                            </svg>
                        </button>
                        <button class="production__slider-next general__slider-arrows">
                            <svg width="14" height="22" viewBox="0 0 14 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M1.61612 2.88388L0.732233 2L2.5 0.232233L3.38388 1.11612L1.61612 2.88388ZM11.5 11L12.3839 10.1161L13.2678 11L12.3839 11.8839L11.5 11ZM3.38388 20.8839L2.5 21.7678L0.732233 20L1.61612 19.1161L3.38388 20.8839ZM3.38388 1.11612L12.3839 10.1161L10.6161 11.8839L1.61612 2.88388L3.38388 1.11612ZM12.3839 11.8839L3.38388 20.8839L1.61612 19.1161L10.6161 10.1161L12.3839 11.8839Z" fill="white"/>
                            </svg>
                        </button>
                        <div class="production__slider owl-carousel">
                            <div class="box">
                                <h4>{{ \App\Models\Production::find(1)->workers }}</h4>
                                <p>{{ __('asd.Количество работников') }}</p>
                                <img src="/img/production/1.webp" alt="">
                            </div>
                            <div class="box">
                                <h4>{{ \App\Models\Production::find(1)->territory }}</h4>
                                <p>{{ __('asd.Территория карьера') }}</p>
                                <img src="/img/production/2.webp" alt="">
                            </div>
                            <div class="box">
                                <h4>{{ \App\Models\Production::find(1)->years }}</h4>
                                <p>{{ __('asd.лет на рынке') }}</p>
                                <img src="/img/production/3.webp" alt="">
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </section>
        <section class="section section__map">
            <div class="general__container">
                <div class="map__container">
                    <div class="left">
                        <h2 class="general__title general__animate general__animate-yellow" data-content="{{ __('asd.Наши проекты') }}"><span>{{ __('asd.Наши проекты') }}</span></h2>
                        <p class="general__subtitle">{{ __('asd.Ответственность и исполнительность — отличительные черты нашей компании. Довольный клиент — наша цель.') }}</p>
                        <a href="/projects" class="general__button-two section__buttons">{{ __('asd.Все проекты') }}</a>
                    </div>
                    <div class="right map__btns right-to-left">
                        <img src="/img/bg/map.webp" alt="Map-Tashkent">
                        <div class="box box__one">
                            <img src="{{ \App\Models\Project::find(1)->photo }}" alt="">
                            <h5>{{ \App\Models\Project::find(1)['header_'.$lan] }}</h5>
                            <a href="{{ \App\Models\Project::find(1)->photo }}"></a>
                            <span class="dot"></span>
                        </div>
                        <div class="box box__two">
                            <img src="{{ \App\Models\Project::find(2)->photo }}" alt="">
                            <span class="dot"></span>
                            <h5>
                                {{ \App\Models\Project::find(2)['header_'.$lan] }}
                            </h5>
                            <a href="{{ \App\Models\Project::find(2)->photo }}"></a>
                        </div>
                        <div class="box box__three">
                            <img src="{{ \App\Models\Project::find(21)->photo }}" alt="">
                            <span class="dot"></span>
                            <h5>{{ \App\Models\Project::find(21)['header_'.$lan] }}</h5>
                            <a href="{{ \App\Models\Project::find(21)->photo }}"></a>
                        </div>
                    </div>
                </div>
            </div>
        </section>
        <section class="section section__product">
            <div class="product__container">
                <div class="product__container-left">
                    <div class="content">
                        <h2 class="general__title general__animate general__animate-yellow" data-content="{{ __('asd.ПРОДУКЦИЯ') }}"><span>{{ __('asd.ПРОДУКЦИЯ') }}</span></h2>
                        <p class="general__subtitle">{{ __('asd.Вся продукция производится на современном высокотехнологичном оборудовании европейских компаний.') }}</p>
                        <a href="{{ \App\Models\Catalog::find(1)->catalog }}" class="general__button section__buttons" download>
                            {{ __('asd.Скачать каталог PDF') }}
                        </a>
                    </div>
                    <div class="general__slider-buttons section__buttons">
                        <button class="product__slider-prev general__slider-arrows">
                            <svg width="14" height="22" viewBox="0 0 14 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M12.3839 2.88388L13.2678 2L11.5 0.232233L10.6161 1.11612L12.3839 2.88388ZM2.5 11L1.61612 10.1161L0.732233 11L1.61612 11.8839L2.5 11ZM10.6161 20.8839L11.5 21.7678L13.2678 20L12.3839 19.1161L10.6161 20.8839ZM10.6161 1.11612L1.61612 10.1161L3.38388 11.8839L12.3839 2.88388L10.6161 1.11612ZM1.61612 11.8839L10.6161 20.8839L12.3839 19.1161L3.38388 10.1161L1.61612 11.8839Z" fill="white"/>
                            </svg>
                        </button>
                        <button class="product__slider-next general__slider-arrows">
                            <svg width="14" height="22" viewBox="0 0 14 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M1.61612 2.88388L0.732233 2L2.5 0.232233L3.38388 1.11612L1.61612 2.88388ZM11.5 11L12.3839 10.1161L13.2678 11L12.3839 11.8839L11.5 11ZM3.38388 20.8839L2.5 21.7678L0.732233 20L1.61612 19.1161L3.38388 20.8839ZM3.38388 1.11612L12.3839 10.1161L10.6161 11.8839L1.61612 2.88388L3.38388 1.11612ZM12.3839 11.8839L3.38388 20.8839L1.61612 19.1161L10.6161 10.1161L12.3839 11.8839Z" fill="white"/>
                            </svg>
                        </button>
                    </div>
                </div>
                <div class="product__container-right right-to-left">
                    <div class="product__slider owl-carousel">
                        <a href="/materials/inert" class="product__slider-box" style="background-image: url(/img/product/s1.webp);">
                            <div class="info">
                                <h3 class="name">
                                    {{ __('asd.Инертные материалы') }}
                                </h3>
                                <p class="subtitle">
                                    {{ __('asd.Качество и свойства, соответствующие стандартам – прочность породы и лещадность.') }}
                                </p>
                                <svg width="96" height="96" viewBox="0 0 96 96" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M40.6717 36.8839L39.7878 36L41.5556 34.2322L42.4394 35.1161L40.6717 36.8839ZM54 48.4444L54.8839 47.5606L55.7678 48.4444L54.8839 49.3283L54 48.4444ZM42.4394 61.7728L41.5556 62.6567L39.7878 60.8889L40.6717 60.005L42.4394 61.7728ZM42.4394 35.1161L54.8839 47.5606L53.1161 49.3283L40.6717 36.8839L42.4394 35.1161ZM54.8839 49.3283L42.4394 61.7728L40.6717 60.005L53.1161 47.5606L54.8839 49.3283Z" fill="white"/>
                                    <rect x="-0.5" y="0.5" width="95" height="95" rx="47.5" transform="matrix(-1 0 0 1 95 0)" stroke="white"/>
                                </svg>
                            </div>
                        </a>
                        <a href="/materials/asphalt" class="product__slider-box" style="background-image: url(/img/product/s2.webp);">
                            <div class="info">
                                <h3 class="name">
                                    {{ __('asd.Асфальтовое покрытие') }}
                                </h3>
                                <p class="subtitle">
                                    {{ __('asd.Применение материалов, покрытий и слоев, способных выдержать поток и тяжесть автомобилей.') }}
                                </p>
                                <svg width="96" height="96" viewBox="0 0 96 96" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M40.6717 36.8839L39.7878 36L41.5556 34.2322L42.4394 35.1161L40.6717 36.8839ZM54 48.4444L54.8839 47.5606L55.7678 48.4444L54.8839 49.3283L54 48.4444ZM42.4394 61.7728L41.5556 62.6567L39.7878 60.8889L40.6717 60.005L42.4394 61.7728ZM42.4394 35.1161L54.8839 47.5606L53.1161 49.3283L40.6717 36.8839L42.4394 35.1161ZM54.8839 49.3283L42.4394 61.7728L40.6717 60.005L53.1161 47.5606L54.8839 49.3283Z" fill="white"/>
                                    <rect x="-0.5" y="0.5" width="95" height="95" rx="47.5" transform="matrix(-1 0 0 1 95 0)" stroke="white"/>
                                </svg>
                            </div>
                        </a>
                        <a href="/asphalt" class="product__slider-box" style="background-image: url(/img/product/s3.webp);">
                            <div class="info">
                                <h3 class="name">
                                    {{ __('asd.УКЛАДКА АСФАЛЬТА') }}
                                </h3>
                                <p class="subtitle">
                                    {{ __('asd.Кладка асфальта и бетона на самых сложных участках; Применение модифицированного гибкого битума с полимерами.') }}
                                </p>
                                <svg width="96" height="96" viewBox="0 0 96 96" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M40.6717 36.8839L39.7878 36L41.5556 34.2322L42.4394 35.1161L40.6717 36.8839ZM54 48.4444L54.8839 47.5606L55.7678 48.4444L54.8839 49.3283L54 48.4444ZM42.4394 61.7728L41.5556 62.6567L39.7878 60.8889L40.6717 60.005L42.4394 61.7728ZM42.4394 35.1161L54.8839 47.5606L53.1161 49.3283L40.6717 36.8839L42.4394 35.1161ZM54.8839 49.3283L42.4394 61.7728L40.6717 60.005L53.1161 47.5606L54.8839 49.3283Z" fill="white"/>
                                    <rect x="-0.5" y="0.5" width="95" height="95" rx="47.5" transform="matrix(-1 0 0 1 95 0)" stroke="white"/>
                                </svg>
                            </div>
                        </a>
                        <a href="/technics" class="product__slider-box" style="background-image: url(/img/product/s4.webp);">
                            <div class="info">
                                <h3 class="name">
                                    {{ __('asd.ДОРОЖНАЯ ТЕХНИКА') }}
                                </h3>
                                <p class="subtitle">
                                    {{ __('asd.Асфальтоукладчики, грунтовые катки, грунтовые катки, дорожно-разметочные автомашины с высокой производительностью.') }}
                                </p>
                                <svg width="96" height="96" viewBox="0 0 96 96" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M40.6717 36.8839L39.7878 36L41.5556 34.2322L42.4394 35.1161L40.6717 36.8839ZM54 48.4444L54.8839 47.5606L55.7678 48.4444L54.8839 49.3283L54 48.4444ZM42.4394 61.7728L41.5556 62.6567L39.7878 60.8889L40.6717 60.005L42.4394 61.7728ZM42.4394 35.1161L54.8839 47.5606L53.1161 49.3283L40.6717 36.8839L42.4394 35.1161ZM54.8839 49.3283L42.4394 61.7728L40.6717 60.005L53.1161 47.5606L54.8839 49.3283Z" fill="white"/>
                                    <rect x="-0.5" y="0.5" width="95" height="95" rx="47.5" transform="matrix(-1 0 0 1 95 0)" stroke="white"/>
                                </svg>
                            </div>
                        </a>
                        <a href="/lab" class="product__slider-box" style="background-image: url(/img/product/s5.webp);">
                            <div class="info">
                                <h3 class="name">
                                    {{ __('asd.СОВРЕМЕННАЯ ДОРОЖНО-СТРОИТЕЛЬНАЯ ЛАБОРАТОРИЯ') }}
                                </h3>
                                <p class="subtitle">
                                    {{ __('asd.Контроль качества материалов и работ является основным условием надежности нашей продукции.') }}
                                </p>
                                <svg width="96" height="96" viewBox="0 0 96 96" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M40.6717 36.8839L39.7878 36L41.5556 34.2322L42.4394 35.1161L40.6717 36.8839ZM54 48.4444L54.8839 47.5606L55.7678 48.4444L54.8839 49.3283L54 48.4444ZM42.4394 61.7728L41.5556 62.6567L39.7878 60.8889L40.6717 60.005L42.4394 61.7728ZM42.4394 35.1161L54.8839 47.5606L53.1161 49.3283L40.6717 36.8839L42.4394 35.1161ZM54.8839 49.3283L42.4394 61.7728L40.6717 60.005L53.1161 47.5606L54.8839 49.3283Z" fill="white"/>
                                    <rect x="-0.5" y="0.5" width="95" height="95" rx="47.5" transform="matrix(-1 0 0 1 95 0)" stroke="white"/>
                                </svg>
                            </div>
                        </a>
                        <a href="/planing" class="product__slider-box"  style="background-image: url(/img/product/s6.webp);">
                            <div class="info">
                                <h3 class="name">
                                    {{ __('asd.ПРОЕКТИРОВАНИЕ АВТОМОБИЛЬНЫХ ДОРОГ И ТРАНСПОРТНЫХ СООРУЖЕНИЙ') }}
                                </h3>
                                <p class="subtitle">
                                    {{ __('asd.Широкий спектр проектно-изыскательских работ по обустройству и благоустройству автомобильных дорог и транспортных сооружений.') }}
                                </p>
                                <svg width="96" height="96" viewBox="0 0 96 96" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M40.6717 36.8839L39.7878 36L41.5556 34.2322L42.4394 35.1161L40.6717 36.8839ZM54 48.4444L54.8839 47.5606L55.7678 48.4444L54.8839 49.3283L54 48.4444ZM42.4394 61.7728L41.5556 62.6567L39.7878 60.8889L40.6717 60.005L42.4394 61.7728ZM42.4394 35.1161L54.8839 47.5606L53.1161 49.3283L40.6717 36.8839L42.4394 35.1161ZM54.8839 49.3283L42.4394 61.7728L40.6717 60.005L53.1161 47.5606L54.8839 49.3283Z" fill="white"/>
                                    <rect x="-0.5" y="0.5" width="95" height="95" rx="47.5" transform="matrix(-1 0 0 1 95 0)" stroke="white"/>
                                </svg>
                            </div>
                        </a>
                        <div data-merge="2" class="product__slider-last">
                            <h2 class="general__title">{{ __('asd.СВЯЗАТЬСЯ С НАМИ') }}</h2>
                            <p class="general__subtitle">
                                {{ __('asd.Наши сотрудники помогут выполнить подбор оборудования и расчет цены с учетом ваших требований') }}
                            </p>
                            <span class="product__btn general__button">{{ __('asd.Написать') }}</span>
                        </div>
                    </div>
                </div>
            </div>
        </section>
        <section class="section section__news">
            <div class="general__container">
                <div class="news__container">
                    <div class="top">
                        <h2 class="general__title general__animate general__animate-yellow" data-content="{{ __('asd.Новости') }}"><span>{{ __('asd.Новости') }}</span></h2>
                        <a href="/reports" class="general__button-two right-to-left">{{ __('asd.Все новости') }}</a>
                    </div>
                    <div class="news__slider owl-carousel left-to-right" style="display: flex">
                        @foreach(\App\Models\Report::orderBy('id', 'desc')->take(5)->get() as $data)
                            <a href="/reports/{{ $data->id }}" class="news__slider-box" style="background-image: url({{ $data->photo_a }});">
                                <div class="content">
                                    <span class="date">{{ substr($data->created_at, 0, 10) }}</span>
                                    <h4 class="title">{{ $data['header_'.$lan] }}</h4>
                                </div>
                            </a>
                        @endforeach
                    </div>
                    <div class="general__slider-buttons">
                        <button class="news__slider-prev general__slider-arrows">
                            <svg width="14" height="22" viewBox="0 0 14 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M12.3839 2.88388L13.2678 2L11.5 0.232233L10.6161 1.11612L12.3839 2.88388ZM2.5 11L1.61612 10.1161L0.732233 11L1.61612 11.8839L2.5 11ZM10.6161 20.8839L11.5 21.7678L13.2678 20L12.3839 19.1161L10.6161 20.8839ZM10.6161 1.11612L1.61612 10.1161L3.38388 11.8839L12.3839 2.88388L10.6161 1.11612ZM1.61612 11.8839L10.6161 20.8839L12.3839 19.1161L3.38388 10.1161L1.61612 11.8839Z" fill="white"/>
                            </svg>
                        </button>
                        <button class="news__slider-next general__slider-arrows">
                            <svg width="14" height="22" viewBox="0 0 14 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M1.61612 2.88388L0.732233 2L2.5 0.232233L3.38388 1.11612L1.61612 2.88388ZM11.5 11L12.3839 10.1161L13.2678 11L12.3839 11.8839L11.5 11ZM3.38388 20.8839L2.5 21.7678L0.732233 20L1.61612 19.1161L3.38388 20.8839ZM3.38388 1.11612L12.3839 10.1161L10.6161 11.8839L1.61612 2.88388L3.38388 1.11612ZM12.3839 11.8839L3.38388 20.8839L1.61612 19.1161L10.6161 10.1161L12.3839 11.8839Z" fill="white"/>
                            </svg>
                        </button>
                    </div>
                </div>
            </div>
        </section>
        <section class="section section__production section__production-two">
            <div class="production__container">
                <div class="production__container-left">
                    <div class="content">
                        <h2 class="general__title general__animate general__animate-yellow" data-content="{{ __('asd.С кем работаем') }}">{{ __('asd.С кем работаем') }}</h2>
                        <p class="general__subtitle">{{ __('asd.Благодаря качественной работы и надежности, наша дорожно-строительная компания завоевала доверие у многих представителей малого и среднего бизнеса, частных лиц и государственных учреждений.') }}</p>
                    </div>
                </div>
                <div class="production__container-right">
                    <div class="mob-off">
                        <img class="right__banner right__banner-two active"  src="/img/production/4.webp" alt="">
                        <div class="right__content right__content-two section__buttons">
                            <div class="box active">
                                <img src="/img/production/4.webp" alt="">
                                <h4>{{ \App\Models\Workwith::find(1)['header1_'.$lan] }}</h4>
                                <p>{!! \App\Models\Workwith::find(1)['description1_'.$lan] !!}</p>
                            </div>
                            <div class="box">
                                <img src="/img/production/5.webp" alt="">
                                <h4>{{ \App\Models\Workwith::find(1)['header2_'.$lan] }}</h4>
                                <p>{!! \App\Models\Workwith::find(1)['description2_'.$lan] !!}</p>
                            </div>
                            <div class="box">
                                <img src="/img/production/6.webp" alt="">
                                <h4>{{ \App\Models\Workwith::find(1)['header3_'.$lan] }}</h4>
                                <p>{!! \App\Models\Workwith::find(1)['description3_'.$lan] !!}</p>
                            </div>
                        </div>
                    </div>
                    <div class="production__mob desc-off">
                        <button class="production__slider-prev general__slider-arrows">
                            <svg width="14" height="22" viewBox="0 0 14 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M12.3839 2.88388L13.2678 2L11.5 0.232233L10.6161 1.11612L12.3839 2.88388ZM2.5 11L1.61612 10.1161L0.732233 11L1.61612 11.8839L2.5 11ZM10.6161 20.8839L11.5 21.7678L13.2678 20L12.3839 19.1161L10.6161 20.8839ZM10.6161 1.11612L1.61612 10.1161L3.38388 11.8839L12.3839 2.88388L10.6161 1.11612ZM1.61612 11.8839L10.6161 20.8839L12.3839 19.1161L3.38388 10.1161L1.61612 11.8839Z" fill="white"/>
                            </svg>
                        </button>
                        <button class="production__slider-next general__slider-arrows">
                            <svg width="14" height="22" viewBox="0 0 14 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M1.61612 2.88388L0.732233 2L2.5 0.232233L3.38388 1.11612L1.61612 2.88388ZM11.5 11L12.3839 10.1161L13.2678 11L12.3839 11.8839L11.5 11ZM3.38388 20.8839L2.5 21.7678L0.732233 20L1.61612 19.1161L3.38388 20.8839ZM3.38388 1.11612L12.3839 10.1161L10.6161 11.8839L1.61612 2.88388L3.38388 1.11612ZM12.3839 11.8839L3.38388 20.8839L1.61612 19.1161L10.6161 10.1161L12.3839 11.8839Z" fill="white"/>
                            </svg>
                        </button>
                        <div class="production__slider owl-carousel">
                            <div class="box">
                                <h4>{{ \App\Models\Workwith::find(1)['header1_'.$lan] }}</h4>
                                <p>{!! \App\Models\Workwith::find(1)['description1_'.$lan] !!}</p>
                                <img src="/img/production/4.webp" alt="">
                            </div>
                            <div class="box">
                                <h4>{{ \App\Models\Workwith::find(1)['header2_'.$lan] }}</h4>
                                <p>{!! \App\Models\Workwith::find(1)['description2_'.$lan] !!}</p>
                                <img src="/img/production/5.webp" alt="">
                            </div>
                            <div class="box">
                                <h4>{{ \App\Models\Workwith::find(1)['header3_'.$lan] }}</h4>
                                <p>{!! \App\Models\Workwith::find(1)['description3_'.$lan] !!}</p>
                                <img src="/img/production/6.webp" alt="">
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </section>
        <section class="section section__partners">
            <div class="general__container">
                <div class="partners__container">
                    <div class="top">
                        <div class="left">
                            <h2 class="general__title general__animate general__animate-yellow" data-content="{{ __('asd.Наши партнёры') }}">
                                <span>{{ __('asd.Наши партнёры') }}</span>
                            </h2>
                            <p class="general__subtitle">
                                {{ __('asd.Мы сотрудничаем с европейскими компаниями, которые помогают нам внедрять новейшие технологии, обеспечивая тем самым максимальное качество работ.') }}
                            </p>
                        </div>
                        <div class="right right-to-left">
                            <img src="/img/icons/logo.png" alt="GrandRoad">
                            <svg width="247" height="240" viewBox="0 0 247 240" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M73.7187 232.064L77.7176 222.345L79.5225 223.088L77.8087 227.253L82.8346 229.321L84.5485 225.156L86.3533 225.899L82.3544 235.617L80.5495 234.875L82.2005 230.862L77.1746 228.794L75.5236 232.807L73.7187 232.064Z" fill="#8A8A8A"/>
                                <path d="M63.6591 224.041C62.6432 223.438 62.0138 222.734 61.771 221.926C61.5144 221.123 61.6771 220.23 62.259 219.249L64.6554 215.206L66.1793 216.11L65.6816 216.949C66.0583 216.765 66.4802 216.701 66.9474 216.757C67.4009 216.817 67.8859 217 68.4025 217.306C68.919 217.612 69.32 217.966 69.6053 218.368C69.8855 218.778 70.0414 219.203 70.0729 219.64C70.0907 220.081 69.9821 220.5 69.7474 220.896C69.3799 221.516 68.8582 221.875 68.1824 221.975C67.4929 222.078 66.6531 221.836 65.6631 221.249L63.8809 220.193L63.8197 220.296C63.5338 220.778 63.4607 221.235 63.6003 221.667C63.7313 222.094 64.0809 222.476 64.6491 222.812C65.0365 223.042 65.4554 223.209 65.9057 223.313C66.3473 223.412 66.7611 223.43 67.147 223.368L67.083 224.919C66.5581 224.98 65.9983 224.933 65.4036 224.778C64.8088 224.623 64.2274 224.377 63.6591 224.041ZM67.37 218.282C66.9653 218.042 66.5544 217.921 66.1373 217.918C65.7065 217.918 65.3244 218.052 64.9911 218.32L64.5164 219.121L66.1823 220.109C67.1121 220.66 67.7582 220.63 68.1206 220.019C68.2942 219.726 68.3158 219.424 68.1854 219.114C68.055 218.804 67.7832 218.527 67.37 218.282Z" fill="#8A8A8A"/>
                                <path d="M44.4526 209.947L49.5496 203.759L58.6696 211.271L53.5726 217.459L52.1241 216.266L56.2093 211.306L53.8105 209.33L49.7253 214.29L48.2767 213.097L52.362 208.137L49.9864 206.18L45.9011 211.14L44.4526 209.947Z" fill="#8A8A8A"/>
                                <path d="M37.8751 203.41L36.6392 201.997L40.6161 198.517L33.7226 198.665L32.5955 197.377L38.6286 192.097L39.8645 193.509L35.8876 196.989L42.7712 196.831L43.9082 198.13L37.8751 203.41Z" fill="#8A8A8A"/>
                                <path d="M17.9296 174.496L25.0273 170.768L25.8929 172.416L20.2041 175.404L22.0399 178.9L27.7288 175.912L28.6013 177.573L21.5036 181.301L17.9296 174.496Z" fill="#8A8A8A"/>
                                <path d="M13.1152 163.281C12.7127 162.171 12.6738 161.227 12.9986 160.449C13.3106 159.665 14.0029 159.079 15.0756 158.69L19.4933 157.088L20.0972 158.754L19.1797 159.086C19.5875 159.183 19.9542 159.402 20.2796 159.741C20.5923 160.075 20.851 160.524 21.0557 161.089C21.2604 161.654 21.3454 162.182 21.3107 162.673C21.2666 163.168 21.1179 163.595 20.8644 163.953C20.5982 164.305 20.2486 164.56 19.8158 164.716C19.1383 164.962 18.5069 164.909 17.9214 164.557C17.3232 164.199 16.8279 163.479 16.4356 162.397L15.7294 160.449L15.6165 160.49C15.0896 160.681 14.7429 160.988 14.5767 161.41C14.407 161.823 14.4347 162.34 14.6599 162.961C14.8134 163.384 15.0311 163.779 15.3129 164.145C15.5913 164.502 15.8993 164.779 16.2369 164.976L15.2033 166.133C14.7589 165.847 14.3561 165.456 13.9948 164.959C13.6336 164.461 13.3404 163.902 13.1152 163.281ZM19.6382 161.188C19.4779 160.745 19.2375 160.391 18.9171 160.124C18.5839 159.851 18.2035 159.712 17.7759 159.707L16.9009 160.024L17.561 161.845C17.9294 162.861 18.4477 163.248 19.1158 163.006C19.4357 162.89 19.6437 162.671 19.7398 162.349C19.8358 162.026 19.802 161.639 19.6382 161.188Z" fill="#8A8A8A"/>
                                <path d="M8.59518 147.565C8.43085 146.802 8.45077 146.086 8.65493 145.418C8.85698 144.739 9.22446 144.164 9.75737 143.691C10.2903 143.218 10.953 142.896 11.7455 142.725C12.5381 142.554 13.2794 142.574 13.9696 142.784C14.65 142.996 15.2218 143.369 15.6851 143.904C16.1463 144.429 16.459 145.073 16.6234 145.837C16.8509 146.893 16.6788 147.806 16.107 148.574L19.9083 147.755L20.3033 149.59L9.61864 151.891L9.24259 150.144L10.27 149.923C9.83284 149.7 9.47392 149.388 9.19321 148.988C8.9104 148.577 8.71105 148.103 8.59518 147.565ZM15.0972 146.38C14.9518 145.705 14.6078 145.201 14.065 144.867C13.5201 144.524 12.8807 144.431 12.1469 144.589C11.413 144.747 10.8685 145.095 10.5132 145.632C10.1558 146.159 10.0498 146.761 10.1952 147.436C10.29 147.876 10.478 148.25 10.7593 148.558C11.0309 148.868 11.3747 149.086 11.7907 149.211C12.2068 149.337 12.6594 149.347 13.1486 149.242C13.6379 149.136 14.0463 148.941 14.3738 148.655C14.7014 148.37 14.93 148.029 15.0596 147.632C15.1795 147.238 15.192 146.821 15.0972 146.38Z" fill="#8A8A8A"/>
                                <path d="M7.77864 128.826L8.00538 131.624L14.41 131.105L14.5616 132.976L8.15695 133.495L8.3849 136.308L6.7987 136.436L6.19245 128.954L7.77864 128.826Z" fill="#8A8A8A"/>
                                <path d="M6.0389 121.432L6.13339 119.558L9.38711 119.722L9.59047 115.689L6.33675 115.525L6.43125 113.65L14.4381 114.054L14.3436 115.928L11.1798 115.769L10.9765 119.802L14.1402 119.962L14.0457 121.836L6.0389 121.432Z" fill="#8A8A8A"/>
                                <path d="M12.9185 97.9718C13.0462 97.9965 13.2262 98.0414 13.4582 98.1066L12.2662 104.283C12.8669 104.287 13.3828 104.096 13.814 103.71C14.2373 103.313 14.5143 102.775 14.6452 102.097C14.8121 101.232 14.6646 100.465 14.2028 99.7946L15.5284 99.026C15.8827 99.4613 16.1158 99.9701 16.2277 100.552C16.3396 101.135 16.3301 101.765 16.1992 102.443C16.0323 103.308 15.7134 104.036 15.2423 104.628C14.7713 105.22 14.196 105.639 13.5166 105.885C12.8292 106.12 12.0973 106.162 11.3209 106.012C10.5544 105.864 9.89964 105.559 9.35673 105.098C8.80588 104.624 8.41822 104.045 8.19375 103.36C7.96928 102.674 7.93196 101.943 8.0818 101.167C8.22974 100.4 8.53354 99.7504 8.99319 99.2173C9.44492 98.6725 10.0126 98.2927 10.6962 98.0781C11.3719 97.8517 12.1126 97.8163 12.9185 97.9718ZM9.55591 101.451C9.44211 102.041 9.52228 102.576 9.7964 103.057C10.0626 103.527 10.4771 103.861 11.0398 104.062L11.9018 99.5951C11.3167 99.5638 10.8083 99.7154 10.3768 100.05C9.94523 100.385 9.67161 100.852 9.55591 101.451ZM6.6475 102.419C6.59818 102.674 6.47387 102.87 6.27456 103.004C6.07525 103.139 5.84784 103.182 5.59233 103.133C5.32699 103.081 5.12691 102.956 4.99209 102.757C4.85726 102.558 4.81451 102.33 4.86382 102.075C4.91314 101.819 5.03745 101.624 5.23675 101.489C5.43606 101.354 5.66839 101.313 5.93373 101.364C6.18924 101.413 6.38441 101.537 6.51923 101.737C6.65405 101.936 6.69681 102.163 6.6475 102.419ZM7.19942 99.5591C7.15011 99.8146 7.0258 100.01 6.82649 100.145C6.62718 100.279 6.39977 100.322 6.14426 100.273C5.87892 100.222 5.67884 100.096 5.54401 99.8971C5.40919 99.6978 5.36644 99.4704 5.41575 99.2149C5.46506 98.9594 5.58937 98.7642 5.78868 98.6294C5.98799 98.4946 6.22031 98.4528 6.48565 98.504C6.74117 98.5533 6.93633 98.6776 7.07116 98.8769C7.20598 99.0762 7.24873 99.3036 7.19942 99.5591Z" fill="#8A8A8A"/>
                                <path d="M12.4386 84.8201C12.6922 84.0817 13.0792 83.4792 13.5994 83.0123C14.1228 82.536 14.7349 82.233 15.4356 82.1034C16.1363 81.9737 16.87 82.0406 17.6367 82.304C18.4034 82.5674 19.0281 82.9672 19.5106 83.5034C19.9836 84.0363 20.2803 84.6515 20.4005 85.3489C20.5239 86.0369 20.4588 86.7501 20.2052 87.4884C19.8539 88.5107 19.2351 89.2029 18.3487 89.5651L22.0261 90.8285L21.4164 92.6034L11.0798 89.0521L11.6603 87.3625L12.6542 87.7039C12.3953 87.2869 12.2491 86.8346 12.2156 86.3468C12.1854 85.8496 12.2597 85.3407 12.4386 84.8201ZM18.6176 87.1652C18.842 86.5121 18.808 85.9025 18.5157 85.3364C18.2266 84.7608 17.7271 84.3511 17.0172 84.1072C16.3073 83.8633 15.6614 83.8795 15.0797 84.1559C14.5012 84.4228 14.0997 84.8828 13.8753 85.5359C13.729 85.9619 13.6966 86.3794 13.7784 86.7885C13.8506 87.1943 14.0324 87.5583 14.3238 87.8807C14.6152 88.2031 14.9976 88.4455 15.4708 88.6081C15.9441 88.7707 16.3948 88.8144 16.8228 88.7392C17.2507 88.664 17.6227 88.4902 17.9385 88.2177C18.2449 87.942 18.4713 87.5912 18.6176 87.1652Z" fill="#8A8A8A"/>
                                <path d="M21.3116 70.9325C21.7874 70.0292 22.3549 69.4458 23.0141 69.1821C23.6733 68.9185 24.3749 68.9826 25.1187 69.3744C25.898 69.7848 26.3603 70.3676 26.5055 71.1229C26.6554 71.8692 26.4717 72.7227 25.9544 73.6833L24.248 76.8908L17.1547 73.1548L18.0293 71.4944L20.3539 72.7187L21.3116 70.9325ZM20.9258 65.9951L21.8003 64.3347L28.8936 68.0707L28.019 69.7312L20.9258 65.9951ZM24.6554 73.1857C24.9208 72.7033 25.0148 72.2778 24.9376 71.909C24.8603 71.5403 24.618 71.2486 24.2106 71.0341C23.8121 70.8242 23.4546 70.7942 23.138 70.9442C22.8215 71.0942 22.5258 71.4193 22.2511 71.9194L21.4962 73.3204L23.9005 74.5868L24.6554 73.1857Z" fill="#8A8A8A"/>
                                <path d="M37.6454 39.4199L45.4189 46.492L44.1055 47.9357L40.774 44.9047L37.1167 48.9248L40.4482 51.9557L39.1348 53.3994L31.3613 46.3272L32.6747 44.8836L35.884 47.8033L39.5413 43.7833L36.332 40.8635L37.6454 39.4199Z" fill="#8A8A8A"/>
                                <path d="M48.6137 32.6996C49.5262 31.9498 50.4032 31.5983 51.2449 31.6452C52.0879 31.6779 52.8716 32.1351 53.5959 33.0167L56.5791 36.6474L55.2104 37.772L54.5909 37.018C54.6354 37.4348 54.5518 37.8533 54.34 38.2735C54.1295 38.6795 53.7923 39.0732 53.3283 39.4544C52.8644 39.8357 52.3948 40.0919 51.9198 40.2232C51.4383 40.3467 50.9866 40.3487 50.5645 40.2292C50.1438 40.0956 49.7873 39.8509 49.495 39.4952C49.0375 38.9384 48.8771 38.3253 49.0137 37.656C49.1518 36.9727 49.6654 36.2656 50.5547 35.5349L52.1555 34.2196L52.0793 34.1268C51.7234 33.6938 51.3187 33.4693 50.8652 33.4533C50.4194 33.431 49.9413 33.6295 49.4309 34.0489C49.0829 34.3348 48.7832 34.6717 48.5319 35.0596C48.2884 35.441 48.13 35.8238 48.0569 36.2077L46.6212 35.6192C46.7426 35.1048 46.9775 34.5945 47.3257 34.0881C47.674 33.5818 48.1033 33.1189 48.6137 32.6996ZM52.7626 38.1511C53.1261 37.8524 53.3803 37.5075 53.5252 37.1164C53.6716 36.7112 53.6757 36.3062 53.5375 35.9016L52.9466 35.1824L51.4502 36.4119C50.615 37.0981 50.423 37.7158 50.8741 38.2648C51.0902 38.5278 51.3661 38.6508 51.702 38.6339C52.0379 38.617 52.3914 38.4561 52.7626 38.1511Z" fill="#8A8A8A"/>
                                <path d="M68.4106 19.4471L72.4908 26.3482L62.3201 32.3615L58.2399 25.4605L59.8553 24.5054L63.1256 30.0365L65.8008 28.4549L62.5305 22.9237L64.1459 21.9686L67.4162 27.4998L70.0654 25.9334L66.7952 20.4022L68.4106 19.4471Z" fill="#8A8A8A"/>
                                <path d="M76.7978 15.4896L78.5468 14.8092L80.463 19.7341L82.6742 13.2033L84.2692 12.5827L87.1762 20.0541L85.4273 20.7346L83.5111 15.8096L81.3138 22.335L79.7048 22.9611L76.7978 15.4896Z" fill="#8A8A8A"/>
                                <path d="M110.781 6.59394L111.866 14.5372L110.021 14.7891L109.152 8.42263L105.239 8.957L106.109 15.3235L104.25 15.5775L103.165 7.63422L110.781 6.59394Z" fill="#8A8A8A"/>
                                <path d="M122.964 5.89291C124.145 5.89291 125.045 6.17816 125.666 6.74866C126.296 7.30915 126.612 8.15989 126.612 9.30089V14H124.84V13.0241C124.61 13.3745 124.28 13.6447 123.849 13.8349C123.429 14.015 122.919 14.1051 122.318 14.1051C121.717 14.1051 121.192 14.005 120.742 13.8048C120.291 13.5946 119.941 13.3094 119.691 12.9491C119.45 12.5788 119.33 12.1634 119.33 11.703C119.33 10.9824 119.596 10.4069 120.126 9.97648C120.667 9.5361 121.512 9.3159 122.663 9.3159L124.735 9.3159V9.1958C124.735 8.63531 124.565 8.20493 124.225 7.90467C123.894 7.60441 123.399 7.45427 122.738 7.45427C122.288 7.45427 121.843 7.52433 121.402 7.66446C120.972 7.80458 120.606 7.99975 120.306 8.24997L119.571 6.88377C119.991 6.56349 120.496 6.31828 121.087 6.14813C121.677 5.97798 122.303 5.89291 122.964 5.89291ZM122.708 12.7389C123.179 12.7389 123.594 12.6338 123.954 12.4236C124.325 12.2034 124.585 11.8932 124.735 11.4928V10.562L122.798 10.562C121.717 10.562 121.177 10.9173 121.177 11.6279C121.177 11.9682 121.312 12.2385 121.582 12.4386C121.853 12.6388 122.228 12.7389 122.708 12.7389Z" fill="#8A8A8A"/>
                                <path d="M139.281 6.99847C140.054 7.10413 140.72 7.36685 141.279 7.78665C141.848 8.20779 142.264 8.74949 142.527 9.41173C142.79 10.074 142.867 10.8067 142.757 11.61C142.647 12.4132 142.376 13.1035 141.944 13.6809C141.513 14.2483 140.967 14.6586 140.306 14.9118C139.655 15.1663 138.943 15.2408 138.169 15.1351C137.098 14.9888 136.299 14.516 135.772 13.7167L135.246 17.5693L133.386 17.3153L134.866 6.48631L136.636 6.72809L136.493 7.76935C136.852 7.4345 137.268 7.20335 137.74 7.07589C138.222 6.94978 138.735 6.92397 139.281 6.99847ZM138.179 13.515C138.863 13.6085 139.454 13.4569 139.953 13.0604C140.461 12.6652 140.766 12.0957 140.868 11.3519C140.97 10.6082 140.828 9.97775 140.445 9.46062C140.071 8.94486 139.541 8.64024 138.857 8.54678C138.411 8.48583 137.995 8.53509 137.61 8.69458C137.226 8.84415 136.904 9.09313 136.644 9.44152C136.384 9.7899 136.22 10.212 136.153 10.7078C136.085 11.2037 136.13 11.6542 136.286 12.0595C136.443 12.4648 136.686 12.7959 137.014 13.053C137.344 13.3001 137.732 13.4541 138.179 13.515Z" fill="#8A8A8A"/>
                                <path d="M157.176 12.6198L154.468 11.8791L152.773 18.0771L150.962 17.582L152.658 11.384L149.935 10.6394L150.355 9.10441L157.596 11.0848L157.176 12.6198Z" fill="#8A8A8A"/>
                                <path d="M164.721 13.5019L166.451 14.2296L165.188 17.2326L168.91 18.7986L170.174 15.7956L171.904 16.5233L168.795 23.9131L167.065 23.1854L168.293 20.2655L164.571 18.6995L163.342 21.6194L161.613 20.8917L164.721 13.5019Z" fill="#8A8A8A"/>
                                <path d="M184.431 27.9681C184.364 28.0798 184.26 28.2336 184.12 28.4295L178.72 25.2036C178.511 25.767 178.515 26.3171 178.731 26.8539C178.96 27.3873 179.371 27.8311 179.964 28.1853C180.72 28.637 181.492 28.7599 182.279 28.5541L182.55 30.0624C182.02 30.2471 181.462 30.2928 180.877 30.1995C180.291 30.1063 179.702 29.8825 179.109 29.5284C178.353 29.0767 177.777 28.5285 177.381 27.8839C176.985 27.2393 176.787 26.5556 176.787 25.833C176.801 25.1069 177.011 24.4044 177.417 23.7256C177.817 23.0554 178.327 22.5438 178.946 22.1907C179.578 21.8341 180.255 21.6672 180.976 21.6898C181.697 21.7125 182.397 21.9265 183.076 22.332C183.746 22.7324 184.253 23.2395 184.598 23.8533C184.956 24.4637 185.119 25.1268 185.088 25.8426C185.071 26.555 184.852 27.2635 184.431 27.9681ZM182.306 23.6209C181.79 23.3129 181.26 23.2058 180.714 23.2995C180.182 23.3898 179.726 23.6654 179.346 24.1261L183.251 26.459C183.48 25.9196 183.511 25.39 183.343 24.8702C183.176 24.3504 182.83 23.934 182.306 23.6209ZM182.387 20.5568C182.164 20.4233 182.023 20.2399 181.964 20.0066C181.905 19.7733 181.943 19.5449 182.076 19.3215C182.215 19.0895 182.401 18.9441 182.634 18.8853C182.867 18.8265 183.096 18.8638 183.319 18.9973C183.542 19.1307 183.684 19.3141 183.742 19.5474C183.801 19.7808 183.761 20.0134 183.623 20.2454C183.489 20.4688 183.306 20.6099 183.072 20.6687C182.839 20.7276 182.611 20.6902 182.387 20.5568ZM184.888 22.0504C184.664 21.917 184.523 21.7336 184.464 21.5003C184.406 21.2669 184.443 21.0386 184.576 20.8152C184.715 20.5832 184.901 20.4378 185.134 20.379C185.368 20.3201 185.596 20.3575 185.819 20.4909C186.043 20.6244 186.184 20.8078 186.243 21.0411C186.302 21.2744 186.262 21.5071 186.123 21.7391C185.99 21.9625 185.806 22.1036 185.573 22.1624C185.34 22.2212 185.111 22.1839 184.888 22.0504Z" fill="#8A8A8A"/>
                                <path d="M196.96 31.9996C197.567 32.4897 198.002 33.0589 198.263 33.707C198.533 34.3615 198.609 35.0402 198.492 35.7431C198.375 36.4461 198.062 37.113 197.553 37.7441C197.044 38.3751 196.455 38.826 195.787 39.0969C195.125 39.3599 194.445 39.4291 193.748 39.3044C193.06 39.186 192.411 38.8817 191.804 38.3915C190.962 37.7129 190.522 36.8952 190.484 35.9384L188.043 38.9649L186.582 37.7867L193.444 29.2797L194.835 30.4013L194.175 31.2193C194.655 31.1181 195.13 31.1348 195.6 31.2696C196.078 31.4106 196.531 31.654 196.96 31.9996ZM192.649 37.0092C193.186 37.4428 193.771 37.6187 194.403 37.5368C195.042 37.4612 195.598 37.1313 196.069 36.547C196.54 35.9627 196.745 35.35 196.684 34.7089C196.63 34.0741 196.334 33.5398 195.797 33.1063C195.446 32.8235 195.065 32.6508 194.652 32.5882C194.246 32.5178 193.842 32.5646 193.44 32.7287C193.037 32.8928 192.679 33.1696 192.365 33.5591C192.051 33.9486 191.856 34.3573 191.781 34.7853C191.705 35.2133 191.742 35.6222 191.891 36.012C192.045 36.3941 192.298 36.7265 192.649 37.0092Z" fill="#8A8A8A"/>
                                <path d="M206.99 45.0757C207.677 45.8308 208.032 46.5632 208.055 47.2728C208.078 47.9824 207.779 48.6201 207.157 49.1859C206.506 49.7786 205.8 50.0145 205.041 49.8936C204.288 49.7801 203.548 49.3165 202.821 48.5028L200.388 45.8052L206.318 40.4102L207.581 41.7984L205.637 43.5664L206.99 45.0757ZM211.763 46.3959L213.026 47.784L207.096 53.179L205.833 51.7909L211.763 46.3959ZM203.732 47.4511C204.095 47.8651 204.463 48.0986 204.836 48.1516C205.209 48.2047 205.566 48.0763 205.906 47.7664C206.239 47.4633 206.389 47.1374 206.356 46.7887C206.323 46.44 206.118 46.0512 205.742 45.6225L204.682 44.4353L202.672 46.2639L203.732 47.4511Z" fill="#8A8A8A"/>
                                <path d="M231.046 71.1712L221.748 76.0686L220.839 74.3418L224.824 72.2429L222.291 67.4344L218.306 69.5333L217.396 67.8064L226.695 62.909L227.604 64.6358L223.765 66.6578L226.298 71.4663L230.137 69.4444L231.046 71.1712Z" fill="#8A8A8A"/>
                                <path d="M233.627 83.7753C234.021 84.8887 234.052 85.8331 233.721 86.6084C233.403 87.3897 232.706 87.9706 231.63 88.3511L227.2 89.9181L226.61 88.248L227.53 87.9226C227.123 87.8224 226.758 87.6011 226.435 87.2588C226.125 86.9225 225.87 86.4713 225.669 85.9052C225.469 85.339 225.388 84.8103 225.427 84.3189C225.475 83.8242 225.627 83.3988 225.883 83.0428C226.152 82.6928 226.504 82.4411 226.938 82.2876C227.617 82.0473 228.248 82.1054 228.831 82.462C229.426 82.8247 229.916 83.5486 230.3 84.6337L230.991 86.5869L231.104 86.5469C231.632 86.36 231.981 86.056 232.151 85.6351C232.324 85.2236 232.3 84.7064 232.08 84.0837C231.93 83.6591 231.715 83.2625 231.436 82.8941C231.16 82.5351 230.855 82.2557 230.519 82.0561L231.561 80.907C232.003 81.1965 232.403 81.5912 232.76 82.0912C233.118 82.5912 233.407 83.1525 233.627 83.7753ZM227.088 85.8176C227.244 86.2611 227.482 86.6176 227.8 86.8872C228.131 87.1629 228.511 87.3048 228.938 87.3128L229.816 87.0024L229.17 85.1766C228.809 84.1575 228.294 83.7665 227.624 84.0034C227.303 84.1169 227.094 84.3344 226.995 84.6559C226.897 84.9775 226.927 85.3647 227.088 85.8176Z" fill="#8A8A8A"/>
                                <path d="M239.337 106.904L231.459 108.388L229.272 96.7764L237.151 95.2928L237.498 97.137L231.183 98.3261L231.758 101.38L238.073 100.191L238.42 102.035L232.106 103.224L232.675 106.249L238.99 105.06L239.337 106.904Z" fill="#8A8A8A"/>
                                <path d="M240.196 116.138L240.24 118.014L234.957 118.137L240.343 122.442L240.383 124.153L232.368 124.339L232.324 122.463L237.607 122.34L232.222 118.05L232.181 116.324L240.196 116.138Z" fill="#8A8A8A"/>
                                <path d="M236.979 151.118L229.141 149.43L229.533 147.61L235.815 148.963L236.646 145.103L230.364 143.75L230.759 141.916L238.597 143.603L236.979 151.118Z" fill="#8A8A8A"/>
                                <path d="M233.484 162.809C233.082 163.919 232.507 164.669 231.759 165.058C231.017 165.459 230.11 165.466 229.037 165.077L224.619 163.475L225.223 161.81L226.141 162.142C225.89 161.807 225.748 161.404 225.716 160.935C225.69 160.478 225.779 159.967 225.984 159.403C226.189 158.838 226.462 158.378 226.804 158.023C227.155 157.671 227.542 157.439 227.966 157.327C228.396 157.227 228.828 157.256 229.261 157.413C229.938 157.658 230.389 158.104 230.613 158.749C230.842 159.408 230.761 160.278 230.369 161.36L229.663 163.308L229.775 163.349C230.302 163.54 230.765 163.526 231.163 163.309C231.558 163.101 231.868 162.686 232.093 162.065C232.247 161.642 232.333 161.199 232.351 160.737C232.366 160.285 232.307 159.875 232.174 159.507L233.709 159.281C233.867 159.786 233.925 160.344 233.884 160.958C233.843 161.571 233.71 162.188 233.484 162.809ZM227.135 160.235C226.975 160.678 226.932 161.104 227.007 161.514C227.088 161.938 227.291 162.288 227.616 162.566L228.491 162.883L229.151 161.062C229.52 160.046 229.37 159.417 228.702 159.174C228.382 159.058 228.082 159.093 227.802 159.279C227.521 159.465 227.299 159.784 227.135 160.235Z" fill="#8A8A8A"/>
                                <path d="M226.884 177.771C226.521 178.462 226.047 178.999 225.462 179.381C224.872 179.772 224.221 179.979 223.509 180C222.797 180.022 222.082 179.844 221.364 179.467C220.646 179.09 220.09 178.6 219.694 177.997C219.308 177.398 219.108 176.745 219.095 176.037C219.078 175.339 219.251 174.644 219.614 173.953C220.116 172.996 220.833 172.405 221.764 172.182L218.322 170.374L219.194 168.713L228.871 173.795L228.04 175.376L227.11 174.888C227.302 175.339 227.378 175.809 227.337 176.296C227.291 176.792 227.14 177.284 226.884 177.771ZM221.134 174.513C220.812 175.125 220.753 175.732 220.956 176.336C221.154 176.949 221.586 177.43 222.25 177.779C222.915 178.128 223.556 178.21 224.173 178.026C224.785 177.85 225.252 177.456 225.573 176.845C225.782 176.446 225.878 176.038 225.859 175.622C225.85 175.21 225.725 174.822 225.486 174.459C225.247 174.096 224.906 173.798 224.463 173.566C224.02 173.333 223.581 173.221 223.147 173.231C222.712 173.24 222.318 173.355 221.965 173.576C221.62 173.802 221.343 174.115 221.134 174.513Z" fill="#8A8A8A"/>
                                <path d="M215.5 192.679L217.12 190.386L211.871 186.679L212.953 185.146L218.202 188.853L219.83 186.547L221.13 187.465L216.8 193.597L215.5 192.679Z" fill="#8A8A8A"/>
                                <path d="M212.098 199.471L210.824 200.849L208.432 198.638L205.691 201.604L208.083 203.815L206.809 205.193L200.922 199.752L202.195 198.373L204.522 200.523L207.263 197.558L204.937 195.408L206.21 194.029L212.098 199.471Z" fill="#8A8A8A"/>
                                <path d="M191.779 213.07C191.697 212.969 191.588 212.819 191.451 212.62L196.325 208.643C195.866 208.255 195.348 208.071 194.77 208.091C194.19 208.124 193.633 208.36 193.098 208.796C192.415 209.353 192.037 210.037 191.962 210.847L190.452 210.588C190.459 210.026 190.606 209.486 190.893 208.968C191.18 208.449 191.591 207.972 192.126 207.535C192.809 206.978 193.521 206.623 194.262 206.471C195.003 206.318 195.713 206.365 196.392 206.612C197.07 206.872 197.659 207.309 198.159 207.922C198.652 208.526 198.96 209.18 199.08 209.882C199.2 210.599 199.126 211.292 198.859 211.962C198.592 212.632 198.152 213.217 197.54 213.717C196.935 214.21 196.285 214.515 195.591 214.629C194.895 214.758 194.216 214.686 193.553 214.412C192.89 214.153 192.298 213.705 191.779 213.07ZM196.591 212.554C197.056 212.174 197.337 211.712 197.435 211.167C197.532 210.636 197.428 210.113 197.125 209.599L193.6 212.475C194.029 212.874 194.517 213.084 195.062 213.103C195.608 213.123 196.118 212.94 196.591 212.554ZM199.443 213.675C199.645 213.51 199.865 213.44 200.105 213.464C200.344 213.489 200.546 213.602 200.711 213.803C200.882 214.013 200.955 214.237 200.931 214.476C200.906 214.716 200.794 214.918 200.592 215.082C200.39 215.247 200.17 215.317 199.93 215.293C199.691 215.268 199.486 215.152 199.315 214.942C199.15 214.741 199.08 214.52 199.105 214.281C199.129 214.041 199.242 213.839 199.443 213.675ZM197.187 215.516C197.388 215.352 197.609 215.282 197.848 215.306C198.088 215.33 198.29 215.443 198.454 215.645C198.625 215.854 198.698 216.078 198.674 216.318C198.65 216.557 198.537 216.759 198.335 216.924C198.134 217.088 197.913 217.158 197.674 217.134C197.435 217.11 197.229 216.993 197.059 216.784C196.894 216.582 196.824 216.362 196.848 216.122C196.872 215.883 196.985 215.681 197.187 215.516Z" fill="#8A8A8A"/>
                                <path d="M183.721 223.474C183.053 223.878 182.369 224.092 181.671 224.117C180.964 224.147 180.3 223.988 179.679 223.638C179.058 223.289 178.537 222.767 178.118 222.074C177.698 221.38 177.475 220.673 177.448 219.952C177.426 219.24 177.593 218.577 177.948 217.965C178.294 217.358 178.801 216.852 179.469 216.448C180.394 215.888 181.312 215.753 182.225 216.043L180.212 212.717L181.817 211.745L187.476 221.096L185.947 222.021L185.403 221.122C185.335 221.608 185.157 222.049 184.87 222.445C184.575 222.846 184.191 223.189 183.721 223.474ZM180.48 217.713C179.889 218.071 179.525 218.561 179.386 219.182C179.239 219.81 179.36 220.444 179.749 221.086C180.138 221.729 180.644 222.13 181.267 222.291C181.883 222.457 182.486 222.361 183.076 222.003C183.462 221.77 183.754 221.47 183.954 221.104C184.158 220.746 184.252 220.35 184.235 219.916C184.218 219.482 184.08 219.051 183.821 218.622C183.561 218.194 183.244 217.872 182.867 217.655C182.49 217.439 182.093 217.334 181.676 217.341C181.264 217.356 180.866 217.48 180.48 217.713Z" fill="#8A8A8A"/>
                                <path d="M168.008 228.447C167.064 228.835 166.255 228.919 165.58 228.699C164.905 228.479 164.407 227.98 164.087 227.203C163.752 226.388 163.771 225.645 164.143 224.972C164.507 224.303 165.195 223.766 166.207 223.36L169.573 221.991L172.624 229.405L170.888 230.119L169.888 227.689L168.008 228.447ZM165.14 232.484L163.405 233.198L160.354 225.784L162.09 225.07L165.14 232.484ZM166.886 224.574C166.373 224.774 166.028 225.041 165.851 225.373C165.674 225.706 165.673 226.085 165.848 226.511C166.019 226.927 166.275 227.179 166.614 227.267C166.953 227.355 167.388 227.295 167.92 227.087L169.397 226.495L168.363 223.982L166.886 224.574Z" fill="#8A8A8A"/>
                            </svg>
                        </div>
                    </div>
                    <div class="partners__slider owl-carousel section__buttons">
                        @foreach(\App\Models\Partners::all() as $data)
                            <a href="" class="partners__slider-box">
                                <img src="{{ $data->photo }}" alt="">
                            </a>
                        @endforeach
                    </div>
                    <div class="general__slider-buttons">
                        <button class="partners__slider-prev general__slider-arrows">
                            <svg width="14" height="22" viewBox="0 0 14 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M12.3839 2.88388L13.2678 2L11.5 0.232233L10.6161 1.11612L12.3839 2.88388ZM2.5 11L1.61612 10.1161L0.732233 11L1.61612 11.8839L2.5 11ZM10.6161 20.8839L11.5 21.7678L13.2678 20L12.3839 19.1161L10.6161 20.8839ZM10.6161 1.11612L1.61612 10.1161L3.38388 11.8839L12.3839 2.88388L10.6161 1.11612ZM1.61612 11.8839L10.6161 20.8839L12.3839 19.1161L3.38388 10.1161L1.61612 11.8839Z" fill="white"/>
                            </svg>
                        </button>
                        <button class="partners__slider-next general__slider-arrows">
                            <svg width="14" height="22" viewBox="0 0 14 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M1.61612 2.88388L0.732233 2L2.5 0.232233L3.38388 1.11612L1.61612 2.88388ZM11.5 11L12.3839 10.1161L13.2678 11L12.3839 11.8839L11.5 11ZM3.38388 20.8839L2.5 21.7678L0.732233 20L1.61612 19.1161L3.38388 20.8839ZM3.38388 1.11612L12.3839 10.1161L10.6161 11.8839L1.61612 2.88388L3.38388 1.11612ZM12.3839 11.8839L3.38388 20.8839L1.61612 19.1161L10.6161 10.1161L12.3839 11.8839Z" fill="white"/>
                            </svg>
                        </button>
                    </div>
                </div>
            </div>
        </section>
        <section class="section section__feedback">
            <div class="general__container">
                <div class="feedback__container">
                    <div class="feedback__container-left">
                        <h2 class="general__title general__animate general__animate-yellow" data-content="{{ __('asd.Обратная связь') }}">
                            <span>{{ __('asd.Обратная связь') }}</span>
                        </h2>
                        <p class="general__subtitle">
                            {{ __('asd.Вы можете написать нам свой вопрос. Мы ответим вам немедленно. Заполните обязательные поля и нажмите кнопку «Отправить» в предоставленной форме.') }}
                        </p>
                    </div>
                    <div class="feedback__container-right right-to-left">
                        <div class="form-feedback">
                            <input type="hidden" id="form_token" value="{{ csrf_token() }}">
                            <div class="form__box">
                                <label for="name">{{ __('asd.Ваше имя фамилия') }}</label>
                                <input type="text" id="name">
                            </div>
                            <div class="form__box">
                                <label for="tel">{{ __('asd.Ваш номер телефона') }}</label>
                                <input type="text" id="phone">
                            </div>
                            <div class="form__box">
                                <label for="message">{{ __('asd.Ваше сообщение') }}</label>
                                <textarea id="message" cols="30" rows="10"></textarea>
                            </div>
                            <button class="form__button" type="button" onclick="sendMessage()">
                                {{ __('asd.Отправить') }}
                            </button>
                        </div>
                    </div>
                </div>
            </div>
        </section>
        <section class="section section__contact">
            <div class="contact__container">
                <div class="contact__container-left">
                    <h2 class="general__title"><span>{{ __('asd.Контакты') }}</span></h2>
                    <div class="contact__container-box">
                        <p>{{ __('asd.Для экспорта и импорта:') }}</p>
                        <h4>{{ \App\Models\Contacts::find(1)->link }}</h4>
                    </div>
                    <div class="contact__container-box">
                        <p>{{ __('asd.Телефоны:') }}</p>
                        <h4>{{ \App\Models\Contacts::find(1)->phone1 }}</h4>
                        <h4>{{ \App\Models\Contacts::find(1)->phone2 }}</h4>
                    </div>
                    <div class="contact__container-box">
                        <p>{{ __('asd.E-mail:') }}</p>
                        <h4>{{ \App\Models\Contacts::find(1)->email }}</h4>
                    </div>
                </div>
                <div class="contact__map" id="map">
                    <iframe src="https://yandex.ru/map-widget/v1/?um=constructor%3A42ad5a40e7acf486f1fe0e1258b1d1d9d4c8e8106a69ad410d90bde9d587c5ca&amp;source=constructor"   frameborder="0"></iframe>
                </div>
            </div>
        </section>
    </div>
    {{--begin popup--}}
    <div class="map__popup">
        <img class="map__popup-bg" src="/img/map/1.webp" alt="">
        <button class="map__popup-close">
            <svg width="73" height="73" viewBox="0 0 73 73" fill="none" xmlns="http://www.w3.org/2000/svg">
                <circle cx="36.5" cy="36.5" r="36" stroke="#363636"/>
                <path d="M44.4 27.6133C43.88 27.0933 43.04 27.0933 42.52 27.6133L36 34.12L29.48 27.6C28.96 27.08 28.12 27.08 27.6 27.6C27.08 28.12 27.08 28.96 27.6 29.48L34.12 36L27.6 42.52C27.08 43.04 27.08 43.88 27.6 44.4C28.12 44.92 28.96 44.92 29.48 44.4L36 37.88L42.52 44.4C43.04 44.92 43.88 44.92 44.4 44.4C44.92 43.88 44.92 43.04 44.4 42.52L37.88 36L44.4 29.48C44.9066 28.9733 44.9066 28.12 44.4 27.6133Z" fill="white"/>
            </svg>
        </button>
        <div class="map__popup-container">
            <h4>{{ __('asd.TASHKENT CITY DEVELOPMENT') }}</h4>
            <a href="" class="map__popup-btn" data-fancybox="gallery">
                <svg width="94" height="94" viewBox="0 0 94 94" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="47" cy="47" r="35" fill="white"/>
                    <path d="M54.4648 45.9287C55.7982 46.6985 55.7982 48.623 54.4648 49.3928L42.6661 56.2048C41.3328 56.9746 39.6661 56.0124 39.6661 54.4728L39.6661 40.8487C39.6661 39.3091 41.3328 38.3469 42.6661 39.1167L54.4648 45.9287Z" fill="#363435"/>
                </svg>
            </a>
        </div>
    </div>
    {{--end popup--}}
    <div class="section section__bottom">
        <div class="general__container">
            <div class="bottom__container">
                <p>© {{ \Carbon\Carbon::now()->format('Y') }} «GRAND ROAD TASHKENT»</p>
                <div class="messengers">
                    <a href="{{ \App\Models\Contacts::find(1)->telegram }}">
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M21.9661 4.33142L18.3236 18.6511C18.1522 19.3255 17.3594 19.673 16.7095 19.3527L12.1026 17.0843L9.92428 20.4836C9.33156 21.4102 7.83173 21.0083 7.83173 19.925V16.1372C7.83173 15.8443 7.96022 15.565 8.18166 15.3606L17.1595 7.18571C17.1523 7.08352 17.038 6.99502 16.9238 7.06983L6.21071 14.182L2.61114 12.4108C1.76845 11.9952 1.80416 10.8302 2.67538 10.4692L20.4237 3.09157C21.2735 2.73726 22.1875 3.46631 21.9661 4.33142Z" fill="white"/>
                        </svg>
                    </a>
                    <a href="{{ \App\Models\Contacts::find(1)->youtube }}">
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M22.3497 6.93576C21.7773 5.22117 21.0005 4.86405 18.9059 4.4822C17.4648 4.21938 14.9081 4 12.5 4C10.0919 4 7.53486 4.21956 6.09409 4.4822C3.99947 4.86405 3.22273 5.22133 2.65028 6.93576C2.1915 8.31053 2 9.78425 2 11.5C2 13.2158 2.19131 14.6895 2.65028 16.0642C3.22273 17.7788 3.99947 18.136 6.09409 18.5178C7.53499 18.7806 10.0919 19 12.5 19C14.9081 19 17.4651 18.7804 18.9059 18.5178C21.0005 18.136 21.7773 17.7787 22.3497 16.0642C22.8085 14.6895 23 13.2158 23 11.5C23 9.78425 22.8085 8.31045 22.3497 6.93576ZM16.5531 11.9115L10.4386 15.6408C10.0673 15.8672 9.76374 15.7096 9.76374 15.2906V7.70927C9.76374 7.29009 10.0674 7.13259 10.4386 7.359L16.5531 11.0883C16.9244 11.3148 16.9244 11.6851 16.5531 11.9115Z" fill="white"/>
                        </svg>
                    </a>
                    <a href="{{ \App\Models\Contacts::find(1)->facebook }}">
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M8.99994 8.97128C8.59994 1.77128 14.1667 1.58375 17 2.25042V5.75204C16.6667 5.75204 15.6552 5.64589 14.5 5.97079C13.5 6.25204 13 7.30412 13 7.97079V9.97079H17L16 13.9708H13V21.9708H9V13.9708H6V9.97079H8.99994V8.97128Z" fill="white"/>
                        </svg>
                    </a>
                    <a href="{{ \App\Models\Contacts::find(1)->instagram }}">
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M17 2H7C4.23858 2 2 4.23858 2 7V17C2 19.7614 4.23858 22 7 22H17C19.7614 22 22 19.7614 22 17V7C22 4.23858 19.7614 2 17 2ZM16 12C16 14.2091 14.2091 16 12 16C9.79086 16 8 14.2091 8 12C8 9.79086 9.79086 8 12 8C14.2091 8 16 9.79086 16 12ZM18 7C18.5523 7 19 6.55228 19 6C19 5.44772 18.5523 5 18 5C17.4477 5 17 5.44772 17 6C17 6.55228 17.4477 7 18 7Z" fill="white"/>
                        </svg>
                    </a>
                </div>
                <div class="languages">
                    <a href="/languages/ru">RU</a>
                    <a href="/languages/uz">UZ</a>
                    <a href="/languages/en">EN</a>
                </div>
            </div>
        </div>
    </div>

@endsection

@section('script')
    <script>
    </script>
    <script type="text/javascript">
        function sendMessage() {
            var token = $("input#form_token").val();
            var name = $("input#name").val();
            var phone = $("input#phone").val();
            var message = $("textarea#message").val();

            console.log(name, phone, message);
            if (name != '') {
                if (phone != '') {
                    $('.feedback-success').show();
                    $.ajax({
                        type: "get",
                        url: "/feedback/create",
                        data: {
                            '_token': token,
                            name: name,
                            phone: phone,
                            message: message,
                        },
                        contentType: "application/json; charset=utf-8",
                        dataType: "json",
                        failure: function (errMsg) {
                        }
                    });
                    $("input#name").val('');
                    $("input#phone").val('');
                    $("textarea#message").val('');
                }
                else {
                    document.getElementById("phone").placeholder = "Введите номер телефона";
                }
            }else {
                document.getElementById("name").placeholder = "Введите ваше имя";
            }
        }
    </script>
@endsection


